{
  "backend/main.mo": "Main actor for the Mosslight Studios backend, defining data types (Product, Order, Cart, Review, etc.) and state maps for products, orders, messages, user profiles, shopping carts, discussion posts, and notifications, with authorization and blob storage mixins included.",
  "backend/migration.mo": "Migration module that upgrades the actor state by adding portfolioItems, galleryItems, blogPosts, and comments maps to the existing products map when deploying a new version.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (Portfolio, Gallery, Blog, Admin Panel) to their relevant frontend files, components, and test IDs with confidence ratings.",
  "frontend-file-summaries.txt": "JSON document containing short summaries of every frontend source file, describing each component's or page's purpose and notable implementation details.",
  "frontend/index.css": "Global CSS file importing Tailwind directives and defining OKLCH-based CSS custom properties for light and dark theme color tokens including background, foreground, primary, sidebar, and chart colors.",
  "frontend/index.html": "HTML entry point for the Mosslight Studios React app, mounting the root div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root application component that sets up TanStack Router with all routes (shop, gallery, portfolio, blog, forum, admin pages, etc.) wrapped in ThemeProvider and AdminAuthProvider.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Full-page access denied UI component showing a shield alert icon, an explanatory message, and a button to navigate back to the home page.",
  "frontend/src/components/AddToCartButton.tsx": "A button component that allows users to add a product (with optional variant selection for size/color) to the cart, including quantity input and inventory validation.",
  "frontend/src/components/AdminGuard.tsx": "A route guard component that renders children only if the user is authenticated as an admin, showing a loading skeleton or access denied screen otherwise.",
  "frontend/src/components/AdminLoginModal.tsx": "A modal dialog for admin login that accepts an 8-digit passcode, authenticates via useAdminAuth, and redirects to the admin dashboard on success.",
  "frontend/src/components/AdminNotificationsPanel.tsx": "Displays a panel of unread admin and low-inventory notifications with timestamps, allowing admins to mark individual notifications as read.",
  "frontend/src/components/AdminReplyForm.tsx": "A form visible only to admin users that allows posting a reply to a specific discussion board post.",
  "frontend/src/components/AskQuestionForm.tsx": "A form for authenticated users to submit questions to the discussion board, with login-required messaging for unauthenticated users.",
  "frontend/src/components/BlogCard.tsx": "A card component that displays a blog post preview with cover image, title, excerpt, and formatted date, navigating to the full post on click.",
  "frontend/src/components/BlogForm.tsx": "An admin form for creating and publishing blog posts with a title, body text, and optional cover image upload with progress tracking.",
  "frontend/src/components/CommentForm.tsx": "A form component for submitting comments on a parent entity (e.g., blog post or product), requiring a name and comment text.",
  "frontend/src/components/CommentList.tsx": "Displays a list of comments for a given parent entity (e.g., gallery item), showing author, date, and text, with loading skeletons and an empty state.",
  "frontend/src/components/CustomerMessagesPanel.tsx": "Renders a list of messages sent from Mosslight Studios to a customer, displaying content, timestamp, and an 'Announcement' badge for broadcast messages.",
  "frontend/src/components/DiscussionPostList.tsx": "Renders a sorted list of discussion forum posts as clickable cards showing the question, status badge, date, and reply count.",
  "frontend/src/components/Footer.tsx": "Site footer displaying social media links, copyright year, and a 'Built with caffeine.ai' attribution link.",
  "frontend/src/components/GalleryGrid.tsx": "Displays a responsive grid of gallery items with images, titles, descriptions, and inline comment list/form components, including loading skeletons and an empty state.",
  "frontend/src/components/GalleryItem.tsx": "Renders a single social media content card with an optional image, badge, timestamp, and text, and fires an analytics content-view event on mount.",
  "frontend/src/components/GalleryItemForm.tsx": "Admin form for adding a new gallery item with a title, description, and image upload that tracks upload progress and calls the addGalleryItem mutation.",
  "frontend/src/components/GalleryUploadForm.tsx": "Admin form for uploading social media content with optional text and multiple media files, tracking upload progress and calling the addSocialMediaContent mutation.",
  "frontend/src/components/Header.tsx": "Sticky site header with navigation links, cart item count badge, notification bell, Internet Identity login/logout, and admin authentication modal access.",
  "frontend/src/components/Layout.tsx": "Root layout component that wraps all pages with the shared Header, Footer, and a main content area rendered via TanStack Router's Outlet.",
  "frontend/src/components/LoginButton.tsx": "Renders a login/logout button using Internet Identity authentication, showing a truncated principal with a copy-to-clipboard option when authenticated.",
  "frontend/src/components/MessageComposer.tsx": "Provides a form card for composing and sending broadcast messages to all customers, using the useSendMessage hook.",
  "frontend/src/components/MessageHistory.tsx": "Displays a list of sent messages as cards, showing timestamp, broadcast/direct badge, content, and optional recipient info.",
  "frontend/src/components/MyOrderCard.tsx": "Renders a detailed card for a single customer order, including line items with variant info, per-item tax and shipping breakdowns, and a grand total.",
  "frontend/src/components/NotificationBell.tsx": "Shows a bell icon with an unread count badge that opens a dropdown listing unread notifications with icons, messages, and relative timestamps; clicking a notification marks it as read.",
  "frontend/src/components/OrderList.tsx": "Displays a searchable list of orders for admins, allowing filtering by order ID or customer and inline status updates via a select dropdown.",
  "frontend/src/components/OrderStatusBadge.tsx": "A small presentational component that renders a styled Badge for an order status value (pending, shipped, or delivered).",
  "frontend/src/components/PortfolioForm.tsx": "A form for adding a new portfolio item with title, category, description, and image upload fields, including an upload progress bar.",
  "frontend/src/components/PortfolioGrid.tsx": "Renders a responsive grid of portfolio items with images, titles, categories, and dates, showing skeleton loaders while loading and an empty state message when no items exist.",
  "frontend/src/components/PostStatusBadge.tsx": "Displays a styled badge for a post's status ('open' or 'answered') with appropriate color variants for light and dark modes.",
  "frontend/src/components/PrincipalDisplay.tsx": "Shows the authenticated user's Internet Identity principal in a banner with a copy-to-clipboard button, only rendering when an identity is present.",
  "frontend/src/components/ProductCard.tsx": "Renders a product card with image, name, star rating, description, and price (supporting variants), and records an analytics event on click.",
  "frontend/src/components/ProductFilterSidebar.tsx": "Provides a collapsible filter sidebar for products with category, price range, color, and size filters, derived dynamically from the product list, with active filter badges and a clear-all option.",
  "frontend/src/components/ProductForm.tsx": "A form component for creating or editing a product, handling fields like name, SKU, price, inventory, variants, images, and tags (categories, colors, sizes) with upload progress tracking.",
  "frontend/src/components/ProductReviews.tsx": "Displays a list of product reviews with star ratings, verified purchase badges, and timestamps, along with an aggregate average rating summary.",
  "frontend/src/components/ProductSearch.tsx": "Provides a search bar and price range dropdown to filter a product list in real time, with a clear-filters button when any filter is active.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that collects a new user's name, email, and shipping address, then saves the profile via the `useSaveCallerUserProfile` hook. The modal cannot be dismissed until the form is submitted successfully.",
  "frontend/src/components/ReplyList.tsx": "Renders a sorted list of admin replies for a support thread, displaying each reply's timestamp and content inside a styled card with an Admin badge.",
  "frontend/src/components/ReviewForm.tsx": "A product review form with a star-rating picker and text area that submits a review via `useSubmitReview`; requires the user to be authenticated and to have purchased the product.",
  "frontend/src/components/SocialMediaLinks.tsx": "Renders icon links to Mosslight Studios' Instagram, Facebook, and TikTok profiles in a horizontal row.",
  "frontend/src/components/VariantManager.tsx": "An inline CRUD UI for managing product variants (size, color, price, inventory), supporting add, edit, and delete operations with form validation before propagating changes via an `onChange` callback.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor (authenticated or anonymous) using React Query, re-initializing it when the Internet Identity changes and invalidating all dependent queries on actor updates.",
  "frontend/src/hooks/useAdminAuth.tsx": "Provides an `AdminAuthContext` that supports two admin authentication paths: a passcode stored in localStorage and automatic admin detection via `registerOrLogin`/`isCallerAdmin` on the backend actor.",
  "frontend/src/hooks/useAnalytics.ts": "Exposes React Query hooks to fetch aggregated analytics data (clicks, views, revenue, orders, low inventory) and to record individual analytics events via the backend actor.",
  "frontend/src/hooks/useBlog.ts": "Provides React Query hooks for fetching all blog posts, adding a new blog post (with optional image), and a stub delete mutation that throws until the backend implements deletion.",
  "frontend/src/hooks/useCart.ts": "Provides React Query hooks for viewing the cart, adding items, clearing the cart, and checking out, with cache invalidation of cart, orders, and products on relevant mutations.",
  "frontend/src/hooks/useComments.ts": "Provides React Query hooks for fetching comments by parent entity and adding new comments, with cache invalidation on mutation success.",
  "frontend/src/hooks/useCustomerMessages.ts": "Provides a React Query hook to fetch the current customer's messages from the backend actor.",
  "frontend/src/hooks/useCustomerOrders.ts": "Provides React Query hooks to fetch all orders or a single order for the currently authenticated customer.",
  "frontend/src/hooks/useDiscussionBoard.ts": "Provides React Query hooks for listing discussion posts, viewing a single thread, creating posts, and adding replies, with cache invalidation on mutations.",
  "frontend/src/hooks/useGallery.ts": "Provides React Query hooks for fetching social media content and gallery items, and mutations for adding gallery items; delete and social media upload are stubbed as unimplemented.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication context provider and hook using DFINITY's AuthClient, managing login state, identity persistence, and delegation validity.",
  "frontend/src/hooks/useMessages.ts": "Provides React Query hooks for fetching all messages and sending a new message to a recipient, with cache invalidation on send.",
  "frontend/src/hooks/useNotifications.ts": "Provides React Query hooks for fetching unread notifications and marking a notification as read, with cache invalidation on mutation.",
  "frontend/src/hooks/useOrders.ts": "Provides React Query hooks for fetching all orders and updating an order's status, with cache invalidation on status update.",
  "frontend/src/hooks/usePortfolio.ts": "Provides React Query hooks for fetching portfolio items and adding new ones; delete is stubbed as unimplemented.",
  "frontend/src/hooks/useProducts.ts": "Provides React Query hooks for CRUD operations on products (get all, get one, add, update, delete), with permission and auth error handling for admin-only mutations.",
  "frontend/src/hooks/useProductVariants.ts": "Provides a React Query hook to fetch product variants for a given product ID with a 30-second stale time.",
  "frontend/src/hooks/useReviews.ts": "Provides React Query hooks for fetching product reviews with average rating and submitting a new review, with cache invalidation on submission.",
  "frontend/src/hooks/useUserProfile.ts": "Provides React Query hooks for fetching and saving the caller's user profile and retrieving their user role from the backend actor.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives and defines CSS custom properties for the Mosslight Studios brand color palette in both light and dark modes, along with base typography styles using Inter and Playfair Display fonts.",
  "frontend/src/main.tsx": "React app entry point that mounts the app with QueryClientProvider for data fetching and InternetIdentityProvider for ICP authentication wrapping the root App component.",
  "frontend/src/pages/AboutPage.tsx": "Static about page for Mosslight Studios displaying the studio's story, mission, and contact information including email and social media links.",
  "frontend/src/pages/AdminAnalyticsPage.tsx": "Admin-protected analytics dashboard showing key metrics (revenue, orders, product clicks, content views) and low inventory alerts fetched via the useGetAnalyticsData hook.",
  "frontend/src/pages/AdminBlogPage.tsx": "Admin-protected blog management page that lists existing blog posts with delete functionality and toggles a BlogForm for creating new posts.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin-protected dashboard landing page that renders navigation cards linking to all admin sections (products, orders, messaging, gallery, analytics, portfolio, blog, etc.) alongside a notifications panel.",
  "frontend/src/pages/AdminGalleryManagementPage.tsx": "Admin-protected page for managing gallery content items, supporting adding new photos via GalleryItemForm and deleting existing items displayed in a responsive grid.",
  "frontend/src/pages/AdminGalleryPage.tsx": "Admin-protected page for uploading and managing social media gallery content, rendering the GalleryUploadForm component.",
  "frontend/src/pages/AdminMessagesPage.tsx": "Admin page for sending messages to customers, with tabs for composing new messages and viewing message history. Protected by AdminGuard.",
  "frontend/src/pages/AdminOrdersPage.tsx": "Admin page that fetches and displays all customer orders via OrderList component. Protected by AdminGuard.",
  "frontend/src/pages/AdminPortfolioPage.tsx": "Admin page for managing portfolio items with add and delete functionality, displaying items in a responsive grid with confirmation dialogs. Protected by AdminGuard.",
  "frontend/src/pages/AdminProductsPage.tsx": "Admin page for managing the product catalog with create, edit, and delete operations, toggling between a product grid and a ProductForm. Protected by AdminGuard.",
  "frontend/src/pages/BlogDetailPage.tsx": "Detail page for a single blog post showing its image, body text, and a comments section with a comment form.",
  "frontend/src/pages/BlogPage.tsx": "Public blog listing page that fetches and renders all blog posts as BlogCard components in a responsive grid.",
  "frontend/src/pages/CartPage.tsx": "Shopping cart page that displays cart items with product details, calculates subtotal, tax, and shipping totals, and provides a clear-cart action.",
  "frontend/src/pages/CheckoutPage.tsx": "Checkout page for authenticated users that shows an order summary with totals, collects payment information, and submits the order via the checkout mutation.",
  "frontend/src/pages/FAQPage.tsx": "Renders a static FAQ page organized into four categories (Shipping, Returns, Product Care, Ordering) using an accordion component for collapsible Q&A items.",
  "frontend/src/pages/ForumPage.tsx": "Displays a discussion board page with a question submission form and a list of recent community questions fetched via the useDiscussionPosts hook.",
  "frontend/src/pages/ForumThreadPage.tsx": "Shows a single forum thread by postId, including the original question, its replies, and an admin reply form, with navigation back to the forum list.",
  "frontend/src/pages/GalleryPage.tsx": "Renders the gallery page displaying studio photos in a grid layout alongside social media follow links, with data fetched via useGetGalleryItems.",
  "frontend/src/pages/HomePage.tsx": "Landing page featuring a hero section with background image, a three-feature highlights grid, and a call-to-action section linking to products and gallery.",
  "frontend/src/pages/MyOrdersPage.tsx": "Authenticated account page showing the user's orders and messages in tabs, with a profile setup modal for new users and an access denied screen for unauthenticated visitors.",
  "frontend/src/pages/OrderSuccessPage.tsx": "Confirmation page shown after a successful order, displaying the order ID and buttons to view orders or continue shopping.",
  "frontend/src/pages/PortfolioPage.tsx": "Renders the portfolio page with a grid of finished artwork items fetched via useGetPortfolioItems.",
  "frontend/src/pages/ProductDetailPage.tsx": "Product detail page that displays product info, variant selectors (size/color), dynamic pricing with tax and shipping, add-to-cart functionality, and customer reviews.",
  "frontend/src/pages/ProductsPage.tsx": "Displays the product catalog page with combined text search and sidebar attribute filtering (category, price, color, size) applied to fetched products. Renders a loading spinner, search bar, filter sidebar, and a responsive grid of ProductCard components.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for reading URL query parameters from both standard and hash-based routing, persisting values to sessionStorage, and cleaning sensitive parameters from the URL hash without a page reload.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom design tokens including oklch-based semantic colors, emerald/nude brand palettes, serif/sans font families, elegant box shadows, and accordion keyframe animations, with typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the overall project state including version, architectural notes, known issues, and lists of existing implemented features and pending new feature requests for an art merchandise and content site."
}