{
  "backend/main.mo": "Main Motoko actor defining all core data types (Product, Order, Cart, Review, etc.) and state maps for an e-commerce platform, mixing in storage and authorization modules. Includes counters for IDs and a hard-coded admin principal.",
  "feature_evidence.json": "Feature evidence report documenting two implemented features: ensuring product prices are stored/transmitted as USD dollars without currency conversion in ProductForm, and ensuring item totals across cart/checkout/order views use raw USD prices without conversion.",
  "frontend-file-summaries.txt": "A JSON document containing short summaries of all frontend source files, describing each component's purpose and notable implementation details for the Mosslight Studios e-commerce app.",
  "frontend/index.css": "Base Tailwind CSS entry file defining OKLCH-based CSS custom properties for light and dark theme color tokens including background, foreground, chart, and sidebar variables.",
  "frontend/index.html": "Minimal HTML entry point for the Mosslight Studios React app, mounting the app into a root div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Defines the TanStack Router route tree for all app pages (home, products, cart, admin sections, forum, etc.) and wraps the app with ThemeProvider, AdminAuthProvider, and Toaster.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Full-page access denied UI component with a shield icon, descriptive message, and a button to navigate back to the home page.",
  "frontend/src/components/AddToCartButton.tsx": "Cart button component that handles quantity input, variant selection validation, inventory checks, and calls the addToCart mutation using either the variant price or base product price.",
  "frontend/src/components/AdminGuard.tsx": "HOC-style guard component that shows a loading skeleton while checking admin status and renders an AccessDeniedScreen if the user is not an authenticated admin.",
  "frontend/src/components/AdminLoginModal.tsx": "Modal dialog component for admin authentication that accepts an 8-digit passcode, calls the login hook, and navigates to the admin dashboard on success.",
  "frontend/src/components/AdminNotificationsPanel.tsx": "Displays unread admin and low-inventory notifications in a card panel, with a button to mark each notification as read.",
  "frontend/src/components/AdminReplyForm.tsx": "Form component visible only to admin users that allows posting a reply to a specific discussion board post.",
  "frontend/src/components/AskQuestionForm.tsx": "Form for authenticated users to submit a new question to the discussion board, with loading and auth-state feedback.",
  "frontend/src/components/CustomerMessagesPanel.tsx": "Renders a list of messages sent to a customer from Mosslight Studios, labeling broadcast messages with an 'Announcement' badge.",
  "frontend/src/components/DiscussionPostList.tsx": "Displays a sorted list of discussion posts as clickable cards showing the question, status badge, timestamp, and reply count.",
  "frontend/src/components/Footer.tsx": "Site footer showing social media links, copyright year, and a 'Built with caffeine.ai' attribution link.",
  "frontend/src/components/GalleryItem.tsx": "Renders a single gallery card with an optional media image, content text, and records a content-view analytics event on mount.",
  "frontend/src/components/GalleryUploadForm.tsx": "Admin form for uploading gallery content with optional media files, showing upload progress and calling the addSocialMediaContent mutation on submit.",
  "frontend/src/components/Header.tsx": "Sticky site header with navigation links, cart icon with item count badge, notification bell, admin login modal, and Internet Identity login/logout handling.",
  "frontend/src/components/Layout.tsx": "Root layout wrapper that renders the Header, a main content area via React Router's Outlet, and the Footer.",
  "frontend/src/components/LoginButton.tsx": "Button component for Internet Identity login/logout that also displays a truncated principal with a copy-to-clipboard action when authenticated.",
  "frontend/src/components/MessageComposer.tsx": "Admin form card for composing and sending broadcast messages to all customers via the useSendMessage hook.",
  "frontend/src/components/MessageHistory.tsx": "Displays a list of previously sent messages as cards, showing timestamp, broadcast/direct badge, content, and optional recipient.",
  "frontend/src/components/MyOrderCard.tsx": "Card component showing a single customer order with its items, variant details, per-line totals, and overall order total pulled from backend data.",
  "frontend/src/components/NotificationBell.tsx": "Dropdown notification bell that fetches unread notifications and allows marking them as read, displaying icons based on notification type and relative timestamps.",
  "frontend/src/components/OrderList.tsx": "Admin order list with search filtering by order ID or customer, and inline status update controls for each order.",
  "frontend/src/components/OrderStatusBadge.tsx": "Small badge component that maps an OrderStatus value (pending/shipped/delivered) to a styled Badge variant and label.",
  "frontend/src/components/PostStatusBadge.tsx": "Badge component that renders a forum post's status (open/answered) with corresponding color styles.",
  "frontend/src/components/PrincipalDisplay.tsx": "Displays the authenticated user's Internet Identity principal in a banner with a copy-to-clipboard button and toast feedback.",
  "frontend/src/components/ProductCard.tsx": "Renders a product card with image, name, star rating, description, and price (supporting variants), and records an analytics event on click.",
  "frontend/src/components/ProductFilterSidebar.tsx": "Sidebar component that derives available filter options (categories, price ranges, colors, sizes) from the product list and manages active filter state with toggle/clear controls.",
  "frontend/src/components/ProductForm.tsx": "Form for creating or editing a product, handling fields like name, SKU, price, inventory, images, tags, and variants, with upload progress tracking and mutation calls.",
  "frontend/src/components/ProductReviews.tsx": "Displays a list of product reviews with star ratings, verified-purchase badges, and timestamps, plus an aggregate average rating summary.",
  "frontend/src/components/ProductSearch.tsx": "Provides a search input and price-range dropdown that filter a product list in real time and notify the parent via a callback.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that collects a new user's name, email, and shipping address on first login and saves the profile via a mutation hook.",
  "frontend/src/components/ReplyList.tsx": "Renders a sorted list of reply cards, each displaying an admin badge and formatted timestamp alongside the reply content.",
  "frontend/src/components/ReviewForm.tsx": "A form component for authenticated users to submit a star rating and text review for a given product, with validation and error toasts.",
  "frontend/src/components/SocialMediaLinks.tsx": "Displays icon links to the Moss Light Studios Instagram, Facebook, and TikTok profiles.",
  "frontend/src/components/VariantManager.tsx": "A CRUD UI component for managing product variants (size, color, price, inventory), supporting add, edit, and delete operations with form validation.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous ICP backend actor using React Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useAdminAuth.tsx": "Provides an AdminAuthContext that handles admin authentication via a hardcoded passcode with 24-hour session persistence, and auto-detects admin status via Internet Identity.",
  "frontend/src/hooks/useAnalytics.ts": "Exposes React Query hooks to fetch aggregated analytics data (clicks, views, revenue, orders, low inventory) and to record analytics events.",
  "frontend/src/hooks/useCart.ts": "Provides React Query hooks for viewing the cart, adding items, clearing the cart, and checking out, with cache invalidation on mutations.",
  "frontend/src/hooks/useCustomerMessages.ts": "Exposes a React Query hook to fetch the authenticated user's messages from the backend.",
  "frontend/src/hooks/useCustomerOrders.ts": "Provides React Query hooks to fetch all of the current user's orders or a single order by ID.",
  "frontend/src/hooks/useDiscussionBoard.ts": "Provides React Query hooks for fetching all discussion posts, a single thread, creating a new post, and adding a reply.",
  "frontend/src/hooks/useGallery.ts": "Provides React Query hooks to fetch social media content and a stub mutation for adding content (not yet implemented in the backend).",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication, managing login/logout state, identity persistence, and AuthClient creation with configurable options.",
  "frontend/src/hooks/useMessages.ts": "Exports React Query hooks for fetching messages and sending a message to a recipient via the backend actor.",
  "frontend/src/hooks/useNotifications.ts": "Exports React Query hooks for fetching unread notifications and marking a notification as read via the backend actor.",
  "frontend/src/hooks/useOrders.ts": "Exports React Query hooks for fetching orders and updating an order's status via the backend actor.",
  "frontend/src/hooks/useProducts.ts": "Exports React Query hooks for fetching, adding, updating, and deleting products via the backend actor, with permission and auth error handling.",
  "frontend/src/hooks/useProductVariants.ts": "Exports a React Query hook for fetching product variants for a given product ID via the backend actor.",
  "frontend/src/hooks/useReviews.ts": "Exports React Query hooks for fetching product reviews with average rating and submitting a new review via the backend actor.",
  "frontend/src/hooks/useUserProfile.ts": "Exports React Query hooks for fetching and saving the caller's user profile and retrieving their user role via the backend actor.",
  "frontend/src/index.css": "Global stylesheet that sets up Tailwind CSS, defines Mosslight Studios brand color tokens for light and dark modes, and imports Google Fonts (Playfair Display and Inter).",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "Static About page displaying Mosslight Studios' story, mission, and contact/social media links using card components.",
  "frontend/src/pages/AdminAnalyticsPage.tsx": "Admin page displaying analytics metrics including total revenue, order count, product clicks, content views, and low inventory alerts, protected by AdminGuard.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard landing page showing navigation cards for all admin sections (products, orders, messages, gallery, forum, analytics) along with a notifications panel.",
  "frontend/src/pages/AdminGalleryPage.tsx": "Admin page for managing the gallery, rendering the GalleryUploadForm component within an AdminGuard wrapper.",
  "frontend/src/pages/AdminMessagesPage.tsx": "Admin page for customer messaging with tabs for composing new messages and viewing message history, protected by AdminGuard.",
  "frontend/src/pages/AdminOrdersPage.tsx": "Admin page that fetches and displays all customer orders using the OrderList component, protected by AdminGuard.",
  "frontend/src/pages/AdminProductsPage.tsx": "Admin page for managing the product catalog with the ability to add, edit, and delete products, toggling between a product grid and a ProductForm.",
  "frontend/src/pages/CartPage.tsx": "Shopping cart page that displays cart items with product details and totals, and allows users to clear the cart or proceed to checkout.",
  "frontend/src/pages/CheckoutPage.tsx": "Checkout page that shows pre-filled shipping info from the user profile and a demo payment input, placing an order on submission and redirecting to an order success page.",
  "frontend/src/pages/FAQPage.tsx": "Renders a static FAQ page organized into four categories (Shipping, Returns, Product Care, Ordering) using an accordion component for collapsible Q&A items.",
  "frontend/src/pages/ForumPage.tsx": "Displays a discussion board page with a question submission form and a list of existing posts fetched via the useDiscussionPosts hook.",
  "frontend/src/pages/ForumThreadPage.tsx": "Shows a single forum thread by postId, displaying the question, status badge, timestamp, replies list, and an admin reply form.",
  "frontend/src/pages/GalleryPage.tsx": "Renders a gallery page that fetches and displays social media content items in a responsive grid alongside social media follow links.",
  "frontend/src/pages/HomePage.tsx": "Landing page featuring a hero section with background image, a three-feature highlights section, and a call-to-action section linking to products and gallery.",
  "frontend/src/pages/MyOrdersPage.tsx": "Authenticated account page showing the user's orders and messages in tabs, with a profile setup modal for new users and an access denied screen for unauthenticated visitors.",
  "frontend/src/pages/OrderSuccessPage.tsx": "Confirmation page shown after a successful order, displaying the order ID and buttons to view orders or continue shopping.",
  "frontend/src/pages/ProductDetailPage.tsx": "Product detail page that fetches a product and its variants, handles size/color selection, displays dynamic pricing, stock status, add-to-cart, and product reviews.",
  "frontend/src/pages/ProductsPage.tsx": "Renders the main products listing page with text search and sidebar filters (category, price range, color, size) applied in combination. Fetches products via a custom hook and displays them in a grid using ProductCard components.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for reading URL query parameters from both standard and hash-based routing, persisting them to sessionStorage, and cleaning sensitive params from the URL hash without a page reload.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the default theme with custom OKLCH-based design tokens, emerald/nude brand colors, Playfair Display/Inter fonts, elegant box shadows, and accordion animations.",
  "project_state.json": "Tracks the current project state for Mosslight Studios e-commerce app, documenting a known currency-conversion bug (prices incorrectly converted from USD to cents/GBP) and listing existing fix features plus a pending backend audit task."
}