{
  "backend/main.mo": "Main Motoko actor defining all core data types (Product, Order, Cart, Review, etc.) and application state maps, with mixins for storage and authorization, counters for IDs, and a hard-coded admin principal fallback.",
  "backend/migration.mo": "Migration module that transforms the old actor state (with HARD_CODED_ADMIN_PRINCIPAL) to the new state shape (with nullable adminPrincipal set to null).",
  "feature_evidence.json": "Feature evidence report linking the admin auto-registration authentication flow feature to its implementing frontend files and associated test/component dependencies.",
  "frontend-file-summaries.txt": "A JSON document containing short summaries of all frontend source files, describing each component, page, hook, and style file in the project.",
  "frontend/index.css": "Global CSS file importing Tailwind directives and defining OKLCH-based CSS custom properties for light and dark theme color tokens including sidebar, chart, and destructive variants.",
  "frontend/index.html": "Minimal HTML entry point for the Mosslight Studios app, mounting the React app at the #root div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with all application routes (public and admin), wrapped in ThemeProvider, AdminAuthProvider, and Toaster.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Full-page access denied UI component with a shield icon, descriptive message, and a button to navigate back to the home page.",
  "frontend/src/components/AddToCartButton.tsx": "Cart button component that handles quantity input and variant selection validation before calling the addToCart mutation, showing appropriate error toasts for inventory or selection issues.",
  "frontend/src/components/AdminGuard.tsx": "Route guard component that shows a loading skeleton while checking admin status, renders AccessDeniedScreen for non-admins, and renders children for authenticated admins.",
  "frontend/src/components/AdminLoginModal.tsx": "Modal dialog component for admin authentication that accepts an 8-digit passcode, calls the login hook, and navigates to the admin dashboard on success.",
  "frontend/src/components/AdminNotificationsPanel.tsx": "Displays unread admin and low-inventory notifications in a card panel, with a button to mark each notification as read.",
  "frontend/src/components/AdminReplyForm.tsx": "Form component visible only to admin users that allows posting a reply to a specific discussion board post.",
  "frontend/src/components/AskQuestionForm.tsx": "Form for authenticated users to submit a new question to the discussion board, with loading and auth-state feedback.",
  "frontend/src/components/CustomerMessagesPanel.tsx": "Renders a list of messages sent to a customer from Mosslight Studios, distinguishing broadcast announcements from direct messages.",
  "frontend/src/components/DiscussionPostList.tsx": "Displays a sorted list of discussion posts as clickable cards showing the question, status badge, timestamp, and reply count.",
  "frontend/src/components/Footer.tsx": "Site footer component showing social media links, copyright year, and a 'Built with caffeine.ai' attribution link.",
  "frontend/src/components/GalleryItem.tsx": "Renders a single gallery card with optional media image, content text, and records a content-view analytics event on mount.",
  "frontend/src/components/GalleryUploadForm.tsx": "Form for uploading gallery content including text and media files, with upload progress tracking and toast notifications.",
  "frontend/src/components/Header.tsx": "Sticky site header with navigation links, cart icon with item count badge, notification bell, admin login modal, and Internet Identity authentication controls.",
  "frontend/src/components/Layout.tsx": "Root layout wrapper that renders the Header, a main content area via React Router's Outlet, and the Footer.",
  "frontend/src/components/LoginButton.tsx": "Button component for Internet Identity login/logout that also displays a truncated principal ID with a copy-to-clipboard action when authenticated.",
  "frontend/src/components/MessageComposer.tsx": "Admin form card for composing and sending broadcast messages to all customers, with recipient type selection and loading state handling.",
  "frontend/src/components/MessageHistory.tsx": "Displays a list of previously sent messages as cards, showing timestamp, broadcast/direct badge, content, and optional recipient info.",
  "frontend/src/components/MyOrderCard.tsx": "Card component showing a single customer order with its items, variant details, per-line totals, order date, and status badge.",
  "frontend/src/components/NotificationBell.tsx": "Dropdown notification bell that fetches unread notifications, displays them with type-specific icons and relative timestamps, and marks them as read on click.",
  "frontend/src/components/OrderList.tsx": "Admin order list with search filtering by order ID or customer, and an inline status selector to update each order's status.",
  "frontend/src/components/OrderStatusBadge.tsx": "Small badge component that maps an OrderStatus value (pending, shipped, delivered) to a styled Badge variant and label.",
  "frontend/src/components/PostStatusBadge.tsx": "Badge component that renders a forum post's status (open or answered) with corresponding color styles.",
  "frontend/src/components/PrincipalDisplay.tsx": "Displays the authenticated user's Internet Identity principal in a banner with a copy-to-clipboard button and toast feedback.",
  "frontend/src/components/ProductCard.tsx": "Renders a product card with image, name, price, stock badge, and star rating, linking to the product detail page and recording analytics on click.",
  "frontend/src/components/ProductFilterSidebar.tsx": "Sidebar component that derives available filter options (categories, price ranges, colors, sizes) from the product list and exposes toggle/clear controls for active filters.",
  "frontend/src/components/ProductForm.tsx": "Form for creating or editing a product, supporting fields for name, SKU, description, price, inventory, images, variants, and tag inputs for categories/colors/sizes.",
  "frontend/src/components/ProductReviews.tsx": "Displays a list of product reviews with star ratings, verified-purchase badges, and timestamps, along with an aggregate average rating summary.",
  "frontend/src/components/ProductSearch.tsx": "Provides a search input and price-range dropdown that filter a product list in real time and notify the parent via a callback.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that collects a new user's name, email, and shipping address on first login and saves the profile via a mutation hook.",
  "frontend/src/components/ReplyList.tsx": "Renders a sorted list of reply cards, each displaying an admin badge and formatted timestamp alongside the reply content.",
  "frontend/src/components/ReviewForm.tsx": "A form component for authenticated users to submit a star rating and text review for a given product, with validation and toast notifications.",
  "frontend/src/components/SocialMediaLinks.tsx": "Displays icon links to Instagram, Facebook, and TikTok profiles for Moss Light Studios.",
  "frontend/src/components/VariantManager.tsx": "A CRUD UI component for managing product variants (size, color, price, inventory) with inline editing, validation, and toast feedback.",
  "frontend/src/hooks/useActor.ts": "A React Query hook that creates and caches an authenticated or anonymous backend actor, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useAdminAuth.tsx": "A React context provider that manages admin authentication via both a hardcoded passcode (stored in localStorage) and Internet Identity, exposing login/logout and initialization state.",
  "frontend/src/hooks/useAnalytics.ts": "Provides React Query hooks to fetch aggregated analytics data (clicks, views, revenue, orders, low inventory) and to record individual analytics events.",
  "frontend/src/hooks/useCart.ts": "Provides React Query hooks for viewing the cart, adding items, clearing the cart, and checking out, with cache invalidation on mutations.",
  "frontend/src/hooks/useCustomerMessages.ts": "A React Query hook that fetches the authenticated user's messages from the backend.",
  "frontend/src/hooks/useCustomerOrders.ts": "Provides React Query hooks to fetch all orders or a single order for the authenticated customer.",
  "frontend/src/hooks/useDiscussionBoard.ts": "Provides React Query hooks for fetching all discussion posts, a single thread, creating a new post, and adding a reply.",
  "frontend/src/hooks/useGallery.ts": "Provides React Query hooks to fetch social media content and a stub mutation for uploading new content (not yet implemented in the backend).",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication, managing login/logout state and persisting identity across page reloads using DFINITY's AuthClient.",
  "frontend/src/hooks/useMessages.ts": "Exports React Query hooks for fetching messages and sending a message to a recipient via the backend actor.",
  "frontend/src/hooks/useNotifications.ts": "Exports React Query hooks for fetching unread notifications and marking a notification as read via the backend actor.",
  "frontend/src/hooks/useOrders.ts": "Exports React Query hooks for fetching orders and updating an order's status via the backend actor.",
  "frontend/src/hooks/useProducts.ts": "Exports React Query hooks for fetching, adding, updating, and deleting products, with permission and authentication error handling for admin-only mutations.",
  "frontend/src/hooks/useProductVariants.ts": "Exports a React Query hook for fetching product variants for a given product ID from the backend actor.",
  "frontend/src/hooks/useReviews.ts": "Exports React Query hooks for fetching product reviews with average rating and submitting a new review via the backend actor.",
  "frontend/src/hooks/useUserProfile.ts": "Exports React Query hooks for fetching and saving the caller's user profile and retrieving their user role from the backend actor.",
  "frontend/src/index.css": "Global stylesheet that sets up Tailwind CSS and defines CSS custom properties for the Mosslight Studios brand color palette in both light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "Static About page displaying Mosslight Studios' story, mission, and contact/social media links.",
  "frontend/src/pages/AdminAnalyticsPage.tsx": "Admin page displaying analytics metrics including total revenue, order count, product clicks, content views, and low inventory alerts, protected by AdminGuard.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard landing page showing navigation cards for all admin sections (products, orders, messages, gallery, forum, analytics) along with a notifications panel.",
  "frontend/src/pages/AdminGalleryPage.tsx": "Admin page for uploading and managing gallery/social media content, wrapping the GalleryUploadForm component inside an AdminGuard.",
  "frontend/src/pages/AdminMessagesPage.tsx": "Admin page with tabs for composing new customer messages and viewing message history, protected by AdminGuard.",
  "frontend/src/pages/AdminOrdersPage.tsx": "Admin page that fetches and displays all customer orders using the OrderList component, protected by AdminGuard.",
  "frontend/src/pages/AdminProductsPage.tsx": "Admin page for managing the product catalog with the ability to add, edit, and delete products, toggling between a product grid and a ProductForm.",
  "frontend/src/pages/CartPage.tsx": "Shopping cart page that displays cart items with product details, calculates totals, and provides options to clear the cart or proceed to checkout.",
  "frontend/src/pages/CheckoutPage.tsx": "Checkout page that displays pre-filled shipping info from the user profile and a demo payment form, placing an order on submission and redirecting to an order success page.",
  "frontend/src/pages/FAQPage.tsx": "Renders a static FAQ page organized into four categories (Shipping, Returns, Product Care, Ordering) using an accordion component for collapsible Q&A items.",
  "frontend/src/pages/ForumPage.tsx": "Displays a discussion board page with a question submission form and a list of recent community questions fetched via the useDiscussionPosts hook.",
  "frontend/src/pages/ForumThreadPage.tsx": "Shows a single forum thread detail page with the original question, its replies, and an admin reply form, fetched by post ID from the URL params.",
  "frontend/src/pages/GalleryPage.tsx": "Renders a gallery page displaying social media content items in a responsive grid, along with social media follow links, fetched via useGetSocialMediaContent.",
  "frontend/src/pages/HomePage.tsx": "Landing page featuring a hero section with background image, a three-feature highlights section, and a call-to-action section linking to the products and gallery pages.",
  "frontend/src/pages/MyOrdersPage.tsx": "Authenticated account page showing the user's orders and messages in tabs, with a profile setup modal for new users and an access denied screen for unauthenticated visitors.",
  "frontend/src/pages/OrderSuccessPage.tsx": "Confirmation page displayed after a successful order, showing the order ID and buttons to navigate to orders or continue shopping.",
  "frontend/src/pages/ProductDetailPage.tsx": "Product detail page that displays product info, variant selectors (size/color), pricing, stock status, add-to-cart button, and a reviews section with a review submission form.",
  "frontend/src/pages/ProductsPage.tsx": "Displays a paginated product collection page with text search and sidebar filters (category, price, color, size) applied in combination. Fetches products via a custom hook and renders them as ProductCard components.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for reading URL query parameters (supporting both standard and hash-based routing), persisting them to sessionStorage, and cleaning sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom colors (emerald/nude palette, semantic tokens via oklch), typography, border radius, shadows, fonts (Playfair Display, Inter), and accordion animations, with typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks project state at version 3, describing an app with Internet Identity login that auto-registers the first login as admin, with one pending backend feature request (AR-1) and one completed frontend feature."
}