{
  "backend/main.mo": "Main Motoko actor defining the e-commerce backend with data types and state for products, orders, messages, shopping carts, reviews, notifications, analytics, and discussion posts, mixing in authorization and blob storage functionality.",
  "feature_evidence.json": "Feature evidence report mapping the Internet Identity principal display feature to its implementing files (Header.tsx and PrincipalDisplay.tsx) with associated components and test IDs.",
  "frontend-file-summaries.txt": "JSON document containing short summaries of each frontend source file, describing the purpose and key details of every component, page, and configuration file in the project.",
  "frontend/index.css": "Base Tailwind CSS entry file defining OKLCH-based CSS custom properties for light and dark theme color tokens including background, foreground, primary, sidebar, and chart colors.",
  "frontend/index.html": "Minimal HTML entry point for the Mosslight Studios app that mounts the React application into a root div and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with all application routes (storefront, admin, forum, etc.) and wraps the app with ThemeProvider, AdminAuthProvider, and Toaster.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Full-page access denied UI component showing a shield alert icon, an explanatory message, and a button to navigate back to the home page.",
  "frontend/src/components/AddToCartButton.tsx": "Cart button component that handles quantity input and variant selection validation before calling the addItemToCart mutation, showing appropriate error toasts for inventory or selection issues.",
  "frontend/src/components/AdminGuard.tsx": "Route guard component that renders children only when the admin is authenticated via useAdminAuth, otherwise displaying the AccessDeniedScreen.",
  "frontend/src/components/AdminLoginModal.tsx": "Modal dialog component for admin authentication that accepts an 8-digit passcode, calls the login hook, and navigates to the admin dashboard on success.",
  "frontend/src/components/AdminNotificationsPanel.tsx": "Displays unread admin and low-inventory notifications in a card panel, with a button to mark each notification as read.",
  "frontend/src/components/AdminReplyForm.tsx": "Form component visible only to admin users that allows posting a reply to a specific discussion board post.",
  "frontend/src/components/AskQuestionForm.tsx": "Form for authenticated users to submit a new question to the discussion board, with loading and auth-state feedback.",
  "frontend/src/components/CustomerMessagesPanel.tsx": "Renders a list of messages sent to a customer from Mosslight Studios, labeling broadcast messages with an 'Announcement' badge.",
  "frontend/src/components/DiscussionPostList.tsx": "Displays a sorted list of discussion posts as clickable cards showing question, status badge, timestamp, and reply count.",
  "frontend/src/components/Footer.tsx": "Site footer component showing social media links, copyright year, and a 'Built with caffeine.ai' attribution link.",
  "frontend/src/components/GalleryItem.tsx": "Renders a single gallery card with optional media image, content text, and records a content-view analytics event on mount.",
  "frontend/src/components/GalleryUploadForm.tsx": "Admin form for uploading gallery content with optional media files, showing upload progress and calling the addSocialMediaContent mutation on submit.",
  "frontend/src/components/Header.tsx": "Sticky site header with navigation links, cart icon with item count, notification bell, admin login modal, and Internet Identity login/logout handling.",
  "frontend/src/components/Layout.tsx": "Root layout component that wraps all pages with a shared Header, Footer, and a main content area rendered via React Router's Outlet.",
  "frontend/src/components/LoginButton.tsx": "Button component that handles Internet Identity login and logout, showing a loading spinner during authentication.",
  "frontend/src/components/MessageComposer.tsx": "Admin form card for composing and sending broadcast messages to all customers, with recipient type selection and submission state handling.",
  "frontend/src/components/MessageHistory.tsx": "Displays a list of previously sent admin messages as cards, showing timestamp, broadcast/direct badge, content, and optional recipient.",
  "frontend/src/components/MyOrderCard.tsx": "Card component showing a single customer order with line items, variant details, per-item pricing, and a total, alongside an order status badge.",
  "frontend/src/components/NotificationBell.tsx": "Dropdown notification bell that fetches unread notifications and allows marking them as read, with icons differentiated by notification type.",
  "frontend/src/components/OrderList.tsx": "Admin order list with search filtering by order ID or customer, and an inline status selector to update each order's status.",
  "frontend/src/components/OrderStatusBadge.tsx": "Small badge component that maps an OrderStatus value (pending, shipped, delivered) to a styled Badge variant and label.",
  "frontend/src/components/PostStatusBadge.tsx": "Badge component that renders a forum post's status (open or answered) with color-coded styles.",
  "frontend/src/components/PrincipalDisplay.tsx": "Displays the authenticated user's Internet Identity principal in a banner with a copy-to-clipboard button and toast feedback.",
  "frontend/src/components/ProductCard.tsx": "Renders a product card with image, name, price, stock badge, and star ratings, linking to the product detail page and recording analytics on click.",
  "frontend/src/components/ProductForm.tsx": "Form component for creating or editing a product, handling image uploads, variants, and connection/auth validation before submitting to the backend.",
  "frontend/src/components/ProductReviews.tsx": "Displays a list of product reviews with star ratings, verified purchase badges, and timestamps, sorted by newest first.",
  "frontend/src/components/ProductSearch.tsx": "Provides search and price-range filter controls that reactively filter a products list and notify the parent via a callback.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that collects name, email, and shipping address from a new user and saves their profile, blocking dismissal until submission.",
  "frontend/src/components/ReplyList.tsx": "Renders a chronologically sorted list of admin replies, each displayed in a styled card with an Admin badge and formatted timestamp.",
  "frontend/src/components/ReviewForm.tsx": "Form for authenticated users to submit a star rating and text review for a product, with validation and error handling for non-purchasers.",
  "frontend/src/components/SocialMediaLinks.tsx": "Renders a row of social media icon links (Instagram, Facebook, TikTok) for Moss Light Studios with hover styling.",
  "frontend/src/components/VariantManager.tsx": "UI component for managing product variants (size, color, price, inventory) with add, edit, and remove functionality including field validation.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous backend actor using React Query, invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useAdminAuth.tsx": "React context provider and hook for admin authentication using a hardcoded passcode with 24-hour session persistence in localStorage and backend initialization.",
  "frontend/src/hooks/useAnalytics.ts": "Hooks for fetching aggregated analytics data (clicks, views, revenue, orders) and recording analytics events via the backend actor.",
  "frontend/src/hooks/useCart.ts": "Hooks for cart operations (view, add item, clear, checkout) that call the backend actor and invalidate relevant React Query caches on success.",
  "frontend/src/hooks/useCustomerMessages.ts": "Hook to fetch the current customer's messages from the backend actor using React Query.",
  "frontend/src/hooks/useCustomerOrders.ts": "Hooks to fetch the current customer's order list or a single order by ID from the backend actor.",
  "frontend/src/hooks/useDiscussionBoard.ts": "Hooks for reading and writing discussion board posts and replies, with React Query cache invalidation on mutations.",
  "frontend/src/hooks/useGallery.ts": "Hooks for fetching social media gallery content and a stub mutation for uploading content (not yet implemented in the backend).",
  "frontend/src/hooks/useInternetIdentity.ts": "Custom Internet Identity authentication hook and provider that wraps DFINITY's AuthClient to manage login, logout, and identity persistence across page reloads.",
  "frontend/src/hooks/useMessages.ts": "Hooks for fetching all messages (admin) and sending a message to a recipient via the backend actor.",
  "frontend/src/hooks/useNotifications.ts": "Hooks for fetching unread notifications and marking a notification as read via the backend actor.",
  "frontend/src/hooks/useOrders.ts": "Hooks for fetching all orders (admin) and updating an order's status via the backend actor.",
  "frontend/src/hooks/useProducts.ts": "Provides React Query hooks for fetching, adding, updating, and deleting products via the backend actor, with permission and auth error handling.",
  "frontend/src/hooks/useProductVariants.ts": "Provides a React Query hook to fetch product variants for a given product ID via the backend actor.",
  "frontend/src/hooks/useReviews.ts": "Provides React Query hooks to fetch product reviews with average rating and submit new reviews via the backend actor.",
  "frontend/src/hooks/useUserProfile.ts": "Provides React Query hooks to get and save the caller's user profile and retrieve their user role from the backend actor.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives and defines Mosslight Studios brand color tokens for light and dark modes, along with base font styles.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "Static About page displaying Mosslight Studios' story, mission, and contact/social media links.",
  "frontend/src/pages/AdminAnalyticsPage.tsx": "Admin analytics dashboard page showing revenue, order count, product clicks, content views, and low inventory alerts using data from the analytics hook.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard landing page displaying navigation cards for all admin sections including products, orders, messaging, gallery, forum, and analytics.",
  "frontend/src/pages/AdminGalleryPage.tsx": "Admin gallery management page that renders the GalleryUploadForm component within an AdminGuard.",
  "frontend/src/pages/AdminMessagesPage.tsx": "Admin-only page for composing and viewing message history sent to customers, using tabs to switch between the MessageComposer and MessageHistory components.",
  "frontend/src/pages/AdminOrdersPage.tsx": "Admin-only page that fetches and displays all customer orders in an OrderList component with a loading spinner while data is fetched.",
  "frontend/src/pages/AdminProductsPage.tsx": "Admin-only page for managing the product catalog, supporting add, edit, and delete operations with a product grid view and an inline ProductForm.",
  "frontend/src/pages/CartPage.tsx": "Shopping cart page that displays cart items with product/variant details, calculates totals, and provides options to clear the cart or proceed to checkout.",
  "frontend/src/pages/CheckoutPage.tsx": "Checkout page for authenticated users that displays pre-filled shipping info from the user profile and accepts a demo payment method to place an order.",
  "frontend/src/pages/FAQPage.tsx": "Static FAQ page organized into categories (Shipping, Returns, Product Care, Ordering) rendered as collapsible accordion sections.",
  "frontend/src/pages/ForumPage.tsx": "Discussion board page that lists existing posts and provides an AskQuestionForm for users to submit new questions.",
  "frontend/src/pages/ForumThreadPage.tsx": "Individual forum thread page that displays a discussion post, its replies, and an AdminReplyForm for admins to respond.",
  "frontend/src/pages/GalleryPage.tsx": "Displays a gallery page that fetches and renders social media content items in a grid, with a loading spinner and social media follow links.",
  "frontend/src/pages/HomePage.tsx": "Renders the Mosslight Studios home page with a hero section, a three-feature highlights section, and a call-to-action section linking to products and gallery.",
  "frontend/src/pages/MyOrdersPage.tsx": "Shows an authenticated user's account page with tabbed views for their orders and messages, redirecting unauthenticated users and prompting profile setup if needed.",
  "frontend/src/pages/OrderSuccessPage.tsx": "Displays an order confirmation screen with a success icon and optional order ID, offering navigation to orders or the products page.",
  "frontend/src/pages/ProductDetailPage.tsx": "Renders a product detail page with variant selection (size/color), dynamic pricing, inventory status, add-to-cart functionality, and a reviews section.",
  "frontend/src/pages/ProductsPage.tsx": "Lists all products in a responsive grid with search/filter support, showing result counts and empty-state messages.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode, custom color palette (oklch variables, emerald, nude), typography/container-queries/animate plugins, and custom fonts, shadows, and accordion keyframes.",
  "project_state.json": "Tracks the current state of an ICP-based art portfolio and merchandise store project, listing existing features, pending feature requests (portfolio, store, Stripe, blog, polls, admin panel), and known issues around hardcoding the admin principal."
}