{
  "kind": "build_request",
  "title": "Auto-register first login user as admin",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the backend to auto-register the first Internet Identity principal that calls a registration or login endpoint as the admin principal. If an admin principal is already set, subsequent logins should not overwrite it.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "Auto-register the first user who logs in as admin on first login, your Internet Identity principal will automatically be stored as the admin principal"
        ]
      },
      "acceptanceCriteria": [
        "If no admin principal is stored, the first authenticated caller's principal is saved as admin.",
        "Subsequent logins do not overwrite the stored admin principal.",
        "The existing admin authorization checks use the stored principal correctly."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the frontend admin authentication flow so that when a user logs in via Internet Identity and no admin is yet registered, the app automatically registers that user as admin and grants admin access without showing a 'Permission Denied' error.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "Permission Denied: Your Internet Identity principal is not registered as an admin. Please log out and log back in as admin."
        ]
      },
      "acceptanceCriteria": [
        "On first login, no 'Permission Denied' error is shown.",
        "The first logged-in user is seamlessly granted admin access.",
        "If an admin is already registered and a different principal logs in, the permission denied message is still shown appropriately."
      ]
    }
  ],
  "constraints": [
    "Do not change any existing admin feature logic beyond the first-login auto-registration flow.",
    "The immutable frontend paths (useInternetIdentity, useActor, main.tsx, components/ui) must not be modified."
  ],
  "nonGoals": [
    "Multi-admin support or admin role management.",
    "Manual admin principal update UI.",
    "Changing the passcode-based admin auth flow beyond what is needed for first-login registration."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}