{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Auto-register first login user as admin",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Update the frontend admin authentication flow to automatically register the first Internet Identity user as admin without showing permission errors",
      "acceptanceCriteria": [
        "On first login, no 'Permission Denied' error is shown.",
        "The first logged-in user is seamlessly granted admin access.",
        "If an admin is already registered and a different principal logs in, the permission denied message is still shown appropriately."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useAdminAuth.tsx",
          "operation": "modify",
          "description": "Update the AdminAuthProvider to call the registerOrLogin backend method immediately after Internet Identity authentication completes. This ensures that if no admin is registered yet, the current principal is automatically registered as admin. The existing passcode-based auth flow remains unchanged. Use the authorization component's guidance to verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/AdminGuard.tsx",
          "operation": "modify",
          "description": "Update the AdminGuard component to check both the passcode-based authentication state and the backend admin role before showing the AccessDeniedScreen. When a user logs in via Internet Identity, query the backend to verify their admin status. If they are admin (either newly registered or previously registered), grant access without showing the permission error. Maintain the existing guard behavior for non-admin principals."
        },
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Update the admin access flow in the Header component. After Internet Identity login, attempt to call registerOrLogin to ensure first-time users are registered as admin. Then verify admin status before showing the AdminLoginModal. If the user is already admin, skip the passcode modal and grant direct access to admin routes. This prevents the 'Permission Denied' message for the first logged-in user."
        }
      ]
    }
  ]
}