{
  "backend/main.mo": "Main actor defining all data types (Product, Order, Customer, Review, Notification, etc.) and state maps for products, orders, messages, user profiles, shopping carts, discussion posts, reviews, and analytics with authorization and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report documenting the addProduct mutation error logging enhancement in useProducts hook and ProductForm component with high confidence.",
  "frontend-file-summaries.txt": "Pre-existing summaries of all frontend files including pages, components, and hooks with details about authentication, product variants, cart functionality, and admin features.",
  "frontend/index.css": "Global CSS with Tailwind directives and OKLCH color system variables for light and dark themes defining background, foreground, primary, secondary, accent, and other UI colors.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx for the Mosslight Studios application.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with all routes (home, products, cart, checkout, gallery, forum, about, FAQ, admin pages) wrapped in ThemeProvider, AdminAuthProvider, and Toaster.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Full-page access denied component with shield icon, error message, and button to return home for unauthorized users.",
  "frontend/src/components/AddToCartButton.tsx": "Component with quantity input and add-to-cart button handling variant selection validation, inventory checks, and cart mutations with toast notifications.",
  "frontend/src/components/AdminGuard.tsx": "Guard component that checks admin authentication status and renders AccessDeniedScreen if not authenticated, otherwise renders children.",
  "frontend/src/components/AdminLoginModal.tsx": "Modal dialog for admin authentication that requires Internet Identity login first, then validates an 8-digit passcode before navigating to the admin dashboard.",
  "frontend/src/components/AdminNotificationsPanel.tsx": "Displays unread admin alerts and low inventory notifications in a card with icons, timestamps, and mark-as-read functionality.",
  "frontend/src/components/AdminReplyForm.tsx": "Form component that allows admin users to post replies to discussion board posts, visible only to users with admin role.",
  "frontend/src/components/AskQuestionForm.tsx": "Form for authenticated users to submit questions to the discussion board with validation and loading states.",
  "frontend/src/components/CustomerMessagesPanel.tsx": "Displays a list of messages sent to customers, showing broadcast announcements and individual messages with timestamps.",
  "frontend/src/components/DiscussionPostList.tsx": "Renders a sorted list of discussion posts as clickable cards showing question, status badge, timestamp, and reply count.",
  "frontend/src/components/Footer.tsx": "Site footer displaying copyright, social media links, and attribution to caffeine.ai with dynamic year and hostname.",
  "frontend/src/components/GalleryItem.tsx": "Card component displaying social media content with optional media image, timestamp, and analytics tracking on mount.",
  "frontend/src/components/GalleryUploadForm.tsx": "Form for uploading gallery content with text and multiple media files, showing upload progress and converting files to ExternalBlob format.",
  "frontend/src/components/Header.tsx": "Main navigation header component with logo, navigation links (Shop, Gallery, About, FAQ, Forum, My Orders), shopping cart with item count badge, login/logout buttons, notification bell, and admin dashboard access for authenticated admin users.",
  "frontend/src/components/Layout.tsx": "Root layout component that wraps pages with Header, main content area (using Outlet for nested routes), and Footer in a flex column structure.",
  "frontend/src/components/LoginButton.tsx": "Authentication button component that handles Internet Identity login/logout and provides an additional Admin Login modal trigger for non-authenticated users.",
  "frontend/src/components/MessageComposer.tsx": "Admin form component for composing and sending broadcast messages to all customers with a textarea input and send button.",
  "frontend/src/components/MessageHistory.tsx": "Displays a list of previously sent messages with timestamps, content, and badges indicating broadcast vs. direct message type.",
  "frontend/src/components/MyOrderCard.tsx": "Card component displaying individual order details including order ID, date, status badge, line items with variants, and calculated total price.",
  "frontend/src/components/NotificationBell.tsx": "Dropdown notification bell component showing unread notifications with icons, timestamps, and mark-as-read functionality on click.",
  "frontend/src/components/OrderList.tsx": "Admin component displaying filterable list of orders with search functionality and inline status update dropdowns for managing order fulfillment.",
  "frontend/src/components/OrderStatusBadge.tsx": "Badge component that displays order status (pending, shipped, delivered) with appropriate styling variants.",
  "frontend/src/components/PostStatusBadge.tsx": "Badge component that displays forum post status (open, answered) with color-coded styling for each state.",
  "frontend/src/components/ProductCard.tsx": "Displays a product card with image, name, price, description, rating stars, review count, and out-of-stock badge. Records analytics events on click and links to product detail page.",
  "frontend/src/components/ProductForm.tsx": "Form component for creating or editing products with fields for name, description, price, inventory, images, and optional variants. Includes validation, image upload with progress tracking, and admin authentication checks.",
  "frontend/src/components/ProductReviews.tsx": "Displays product reviews with star ratings, verified purchase badges, timestamps, and average rating summary. Shows loading state and empty state when no reviews exist.",
  "frontend/src/components/ProductSearch.tsx": "Provides search and filter UI for products with text search and price range dropdown. Filters products in real-time and includes a clear filters button.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for first-time user profile setup requiring name, email, and shipping address. Cannot be dismissed until profile is completed.",
  "frontend/src/components/ReplyList.tsx": "Displays a chronologically sorted list of admin replies with timestamps and admin badges in styled cards.",
  "frontend/src/components/ReviewForm.tsx": "Form for authenticated users to submit product reviews with star rating selector and text input. Validates authentication and purchase status before submission.",
  "frontend/src/components/SocialMediaLinks.tsx": "Renders social media icons (Instagram, Facebook, TikTok) as external links with hover effects.",
  "frontend/src/components/VariantManager.tsx": "React component for managing product variants (size, color, price, inventory) with add, edit, and delete functionality, including field validation and toast notifications.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance with Internet Identity authentication, initializing access control and invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useAdminAuth.tsx": "Context provider and hook for admin authentication using a hardcoded passcode, localStorage session management, and backend admin verification via Internet Identity.",
  "frontend/src/hooks/useAnalytics.ts": "React Query hooks for fetching analytics data (clicks, views, revenue, orders, low inventory) and recording analytics events (product clicks, content views, order completions).",
  "frontend/src/hooks/useCart.ts": "React Query hooks for cart operations including viewing cart items, adding items, clearing cart, and checkout with automatic query invalidation.",
  "frontend/src/hooks/useCustomerMessages.ts": "React Query hook for fetching customer messages associated with the current user.",
  "frontend/src/hooks/useCustomerOrders.ts": "React Query hooks for fetching customer orders, including all orders for the current user and individual order details by ID.",
  "frontend/src/hooks/useDiscussionBoard.ts": "React Query hooks for discussion board functionality including fetching all posts, individual threads, creating posts, and adding replies.",
  "frontend/src/hooks/useGallery.ts": "React Query hooks for social media content management with fetching functionality; add content mutation throws not-yet-implemented error.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication using @dfinity/auth-client, managing login state, identity persistence, and delegation validation.",
  "frontend/src/hooks/useMessages.ts": "React Query hooks for admin message operations including fetching all messages and sending messages to specific customers or broadcast.",
  "frontend/src/hooks/useNotifications.ts": "React Query hooks for fetching unread notifications and marking individual notifications as read with automatic query invalidation.",
  "frontend/src/hooks/useOrders.ts": "React Query hooks for admin order management including fetching all orders and updating order status with automatic query invalidation.",
  "frontend/src/hooks/useProducts.ts": "Provides React Query hooks for product CRUD operations (get all products, get single product, add product, update product, delete product) with detailed console logging for debugging and automatic query invalidation on mutations.",
  "frontend/src/hooks/useProductVariants.ts": "React Query hook for fetching product variants by product ID with 30-second stale time caching.",
  "frontend/src/hooks/useReviews.ts": "Exports React Query hooks for fetching product reviews with average ratings and submitting new reviews, with automatic cache invalidation after submission.",
  "frontend/src/hooks/useUserProfile.ts": "Provides hooks for fetching and saving the current user's profile and role, with query state management and cache invalidation on profile updates.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom Mosslight Studios brand colors in OKLCH format for both light and dark modes, plus Google Fonts imports for Playfair Display and Inter.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider context, then renders the root App component.",
  "frontend/src/pages/AboutPage.tsx": "Displays the About page with Mosslight Studios' story, mission, and contact information including email and social media links in a card-based layout.",
  "frontend/src/pages/AdminAnalyticsPage.tsx": "Admin-only analytics dashboard showing revenue, order count, product clicks, content views, low inventory alerts, most clicked products, and most viewed content with formatted metrics cards.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Main admin dashboard with navigation cards to product management, orders, messaging, gallery, discussion board, and analytics sections, plus an admin notifications panel.",
  "frontend/src/pages/AdminGalleryPage.tsx": "Admin page for managing gallery content with a GalleryUploadForm component wrapped in AdminGuard for access control.",
  "frontend/src/pages/AdminMessagesPage.tsx": "Admin messaging interface with tabs for composing new messages to customers and viewing message history, protected by AdminGuard.",
  "frontend/src/pages/AdminOrdersPage.tsx": "Admin page that displays and manages customer orders using the OrderList component, protected by AdminGuard with loading state handling.",
  "frontend/src/pages/AdminProductsPage.tsx": "Admin page for managing products with CRUD operations (create, read, update, delete), displaying products in a grid with edit/delete actions and a ProductForm modal for adding/editing.",
  "frontend/src/pages/CartPage.tsx": "Shopping cart page that displays cart items with product details and variants, calculates totals, and provides options to clear cart or proceed to checkout.",
  "frontend/src/pages/CheckoutPage.tsx": "Checkout page requiring authentication that displays user profile shipping info, accepts payment details, and processes orders with profile setup modal for new users.",
  "frontend/src/pages/FAQPage.tsx": "Static FAQ page displaying categorized frequently asked questions about shipping, returns, product care, and ordering using an accordion component.",
  "frontend/src/pages/ForumPage.tsx": "Discussion board page that displays a list of customer questions and provides an AskQuestionForm for submitting new questions.",
  "frontend/src/pages/ForumThreadPage.tsx": "Individual forum thread page showing a question post with its replies and an admin reply form, with navigation back to the forum list.",
  "frontend/src/pages/GalleryPage.tsx": "Gallery page displaying social media content items in a grid layout with social media links and empty state handling.",
  "frontend/src/pages/HomePage.tsx": "Landing page component with hero section, feature highlights (curated collection, made with love, unique designs), and call-to-action sections linking to products and gallery.",
  "frontend/src/pages/MyOrdersPage.tsx": "Authenticated user account page displaying orders and messages in tabs, with profile setup modal for new users and access denied screen for unauthenticated visitors.",
  "frontend/src/pages/OrderSuccessPage.tsx": "Order confirmation page showing success message with order ID and navigation buttons to view orders or continue shopping.",
  "frontend/src/pages/ProductDetailPage.tsx": "Product detail page with image display, variant selection (size/color), pricing, inventory status, add-to-cart functionality, and product reviews section.",
  "frontend/src/pages/ProductsPage.tsx": "Product listing page with search/filter functionality, displaying all products in a responsive grid with loading states and empty state handling.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters and session storage, supporting both standard and hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color palette (emerald/nude theme), typography, container queries, animations, and design tokens for the Mosslight Studios brand.",
  "project_state.json": "Project state file tracking an ecommerce platform for Mosslight Studios with 23 versions, featuring admin dashboard, customer portal, social media gallery, and product management with variants. Currently has a known issue where authenticated admin users cannot add products due to backend permission validation failures."
}