{
  "backend/main.mo": "Main backend actor implementing e-commerce functionality including products with variants, orders, shopping carts, user profiles, reviews, notifications, analytics, and discussion forums with role-based access control and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report documenting that the frontend useProducts hook addProduct mutation correctly passes authenticated caller identity to the backend actor.",
  "frontend-file-summaries.txt": "Pre-existing summaries of frontend files describing components, pages, and hooks for the Mosslight Studios e-commerce application with admin passcode authentication and product variant support.",
  "frontend/index.css": "Global CSS with Tailwind directives and OKLCH color system defining light and dark theme variables for the Mosslight Studios brand palette.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx for the Mosslight Studios application.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with all routes (home, products, cart, checkout, admin pages, forum, gallery) wrapped in ThemeProvider, AdminAuthProvider, and Toaster.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Full-page access denied component with shield icon and return-to-home button displayed when users lack permissions.",
  "frontend/src/components/AddToCartButton.tsx": "Add-to-cart component with quantity selector that validates variant selection, checks inventory, and calls useAddItemToCart mutation with productId, quantity, and optional variantId.",
  "frontend/src/components/AdminGuard.tsx": "Guard component that checks admin authentication status via useAdminAuth hook and renders AccessDeniedScreen if not authenticated, otherwise renders children.",
  "frontend/src/components/AdminLoginModal.tsx": "Modal dialog for admin authentication that requires Internet Identity login first, then validates an 8-digit passcode before navigating to the admin dashboard.",
  "frontend/src/components/AdminNotificationsPanel.tsx": "Displays unread admin alerts and low inventory notifications in a card with icons, timestamps, and mark-as-read functionality.",
  "frontend/src/components/AdminReplyForm.tsx": "Form component that allows admin users to post replies to discussion board posts, visible only to users with admin role.",
  "frontend/src/components/AskQuestionForm.tsx": "Form for authenticated users to submit questions to the discussion board with validation and loading states.",
  "frontend/src/components/CustomerMessagesPanel.tsx": "Displays a list of messages sent to customers, showing broadcast announcements and direct messages with timestamps.",
  "frontend/src/components/DiscussionPostList.tsx": "Renders a sorted list of discussion posts with status badges, reply counts, and timestamps, linking to individual post detail pages.",
  "frontend/src/components/Footer.tsx": "Site footer displaying copyright, social media links, and a 'Built with caffeine.ai' attribution with UTM tracking.",
  "frontend/src/components/GalleryItem.tsx": "Card component displaying social media content with optional media preview, automatically recording analytics view events on mount.",
  "frontend/src/components/GalleryUploadForm.tsx": "Form for uploading gallery content with text and multiple media files, showing upload progress and converting files to ExternalBlob format.",
  "frontend/src/components/Header.tsx": "Main navigation header component with logo, navigation links (Shop, Gallery, About, FAQ, Forum, My Orders), cart icon with item count, login/logout buttons, notification bell, and admin dashboard access for authenticated admin users.",
  "frontend/src/components/Layout.tsx": "Root layout component that wraps pages with Header, main content area (Outlet), and Footer in a flex column structure.",
  "frontend/src/components/LoginButton.tsx": "Authentication button component that handles Internet Identity login/logout and displays an admin login modal for non-authenticated users.",
  "frontend/src/components/MessageComposer.tsx": "Admin form component for composing and sending broadcast messages to all customers with a textarea input and send button.",
  "frontend/src/components/MessageHistory.tsx": "Displays a list of previously sent messages with timestamps, content, and badges indicating broadcast or direct message type.",
  "frontend/src/components/MyOrderCard.tsx": "Card component displaying individual order details including order ID, date, status badge, line items with variants, and total price calculation.",
  "frontend/src/components/NotificationBell.tsx": "Dropdown notification bell component showing unread notifications with icons, timestamps, and mark-as-read functionality for order updates, low inventory, and general alerts.",
  "frontend/src/components/OrderList.tsx": "Admin component displaying filterable list of orders with search functionality, status badges, and inline status update dropdowns for managing order fulfillment.",
  "frontend/src/components/OrderStatusBadge.tsx": "Badge component that displays order status (pending, shipped, delivered) with appropriate styling variants.",
  "frontend/src/components/PostStatusBadge.tsx": "Badge component that displays forum post status (open, answered) with color-coded styling for light and dark modes.",
  "frontend/src/components/ProductCard.tsx": "Displays a product card with image, name, price, rating stars, review count, and out-of-stock badge. Records analytics events on click and links to product detail page.",
  "frontend/src/components/ProductForm.tsx": "Form component for creating or editing products with fields for name, description, price, inventory, images, and optional variants. Handles image uploads with progress tracking and form validation.",
  "frontend/src/components/ProductReviews.tsx": "Displays a list of product reviews with star ratings, verified purchase badges, and timestamps. Shows average rating summary and handles empty state.",
  "frontend/src/components/ProductSearch.tsx": "Provides search and filter UI for products with text search and price range dropdown. Filters products in real-time and includes a clear filters button.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for new users to complete their profile with name, email, and shipping address. Prevents dismissal until profile is created.",
  "frontend/src/components/ReplyList.tsx": "Displays a chronologically sorted list of admin replies with timestamps and admin badges in styled cards.",
  "frontend/src/components/ReviewForm.tsx": "Form for authenticated users to submit product reviews with star rating selection and text input. Validates purchase history before allowing submission.",
  "frontend/src/components/SocialMediaLinks.tsx": "Renders social media icons (Instagram, Facebook, TikTok) with links to Mosslight Studios profiles.",
  "frontend/src/components/VariantManager.tsx": "React component for managing product variants (size, color, price, inventory) with add, edit, and delete functionality, including form validation and toast notifications.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance with Internet Identity authentication, initializing access control and invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useAdminAuth.tsx": "Context provider and hook for admin authentication using a hardcoded passcode, localStorage session management, and backend admin verification via Internet Identity.",
  "frontend/src/hooks/useAnalytics.ts": "React Query hooks for fetching analytics data (clicks, views, revenue, orders, low inventory) and recording analytics events (product clicks, content views, order completions).",
  "frontend/src/hooks/useCart.ts": "React Query hooks for cart operations including viewing cart items, adding items, clearing cart, and checkout with automatic query invalidation.",
  "frontend/src/hooks/useCustomerMessages.ts": "React Query hook for fetching customer messages associated with the authenticated user.",
  "frontend/src/hooks/useCustomerOrders.ts": "React Query hooks for fetching customer orders, including all orders for the authenticated user and individual order details by ID.",
  "frontend/src/hooks/useDiscussionBoard.ts": "React Query hooks for discussion board functionality including fetching all posts, individual threads, creating posts, and adding replies with query invalidation.",
  "frontend/src/hooks/useGallery.ts": "React Query hooks for fetching social media content and a placeholder mutation for adding content (not yet implemented in backend).",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login/logout state, identity persistence, and delegation validity with configurable AuthClient options.",
  "frontend/src/hooks/useMessages.ts": "React Query hooks for admin message management including fetching all messages and sending messages to specific customers or broadcast.",
  "frontend/src/hooks/useNotifications.ts": "React Query hooks for fetching unread notifications and marking individual notifications as read with query invalidation.",
  "frontend/src/hooks/useOrders.ts": "React Query hooks for admin order management including fetching all orders and updating order status with query invalidation.",
  "frontend/src/hooks/useProducts.ts": "Provides React Query hooks for product operations including fetching all products, fetching a single product by ID, and adding new products with images. The add product mutation includes extensive logging for debugging authentication and backend communication.",
  "frontend/src/hooks/useProductVariants.ts": "React Query hook for fetching product variants by product ID with 30-second stale time caching.",
  "frontend/src/hooks/useReviews.ts": "Exports React Query hooks for fetching product reviews with average ratings and submitting new reviews. Automatically invalidates review queries after successful submission.",
  "frontend/src/hooks/useUserProfile.ts": "Provides hooks for fetching and saving the current user's profile and role using React Query. Handles actor availability checks and query invalidation on profile updates.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom CSS variables for Mosslight Studios brand colors in light and dark modes, plus typography settings using Playfair Display and Inter fonts.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/AboutPage.tsx": "Displays the About page with Mosslight Studios' story, mission, and contact information including email and social media links.",
  "frontend/src/pages/AdminAnalyticsPage.tsx": "Admin-only analytics dashboard showing revenue, order count, product clicks, content views, and low inventory alerts using cards and metrics visualization.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Main admin dashboard with navigation cards to product management, orders, messaging, gallery, forum, and analytics sections, plus an admin notifications panel.",
  "frontend/src/pages/AdminGalleryPage.tsx": "Admin page for uploading and managing gallery/social media content using the GalleryUploadForm component.",
  "frontend/src/pages/AdminMessagesPage.tsx": "Admin messaging interface with tabs for composing new messages to customers and viewing message history.",
  "frontend/src/pages/AdminOrdersPage.tsx": "Admin page that displays and manages customer orders using the OrderList component, protected by AdminGuard with loading state handling.",
  "frontend/src/pages/AdminProductsPage.tsx": "Admin page for managing products with CRUD operations (create, read, update, delete), displaying products in a grid with edit/delete actions and a ProductForm modal for adding/editing.",
  "frontend/src/pages/CartPage.tsx": "Shopping cart page that displays cart items with product details and variants, calculates totals, and provides clear cart functionality with navigation to checkout.",
  "frontend/src/pages/CheckoutPage.tsx": "Checkout page requiring authentication that displays user shipping info from profile, accepts payment details via form, and processes order placement with navigation to success page.",
  "frontend/src/pages/FAQPage.tsx": "Static FAQ page displaying categorized questions and answers about shipping, returns, product care, and ordering using an accordion component.",
  "frontend/src/pages/ForumPage.tsx": "Discussion board page showing a list of customer questions with an AskQuestionForm component for submitting new questions.",
  "frontend/src/pages/ForumThreadPage.tsx": "Individual forum thread page displaying a question post with its replies and an AdminReplyForm for admins to respond.",
  "frontend/src/pages/GalleryPage.tsx": "Gallery page displaying social media content items in a grid layout with social media links and empty state handling.",
  "frontend/src/pages/HomePage.tsx": "Landing page component with hero section, feature highlights (curated collection, made with love, unique designs), and call-to-action sections linking to products and gallery.",
  "frontend/src/pages/MyOrdersPage.tsx": "Authenticated user account page displaying orders and messages in tabs, with profile setup modal for new users and access denied screen for unauthenticated visitors.",
  "frontend/src/pages/OrderSuccessPage.tsx": "Order confirmation page showing success message with order ID and navigation buttons to view orders or continue shopping.",
  "frontend/src/pages/ProductDetailPage.tsx": "Product detail page with image display, variant selection (size/color), pricing, inventory status, add-to-cart functionality, and product reviews section.",
  "frontend/src/pages/ProductsPage.tsx": "Product listing page with search/filter functionality, displaying all products in a responsive grid with loading states and empty state handling.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme (emerald/nude palette), typography settings, container queries, animations, and shadcn/ui component styling using OKLCH color space.",
  "project_state.json": "Project state file tracking an ecommerce platform for Mosslight Studios with 25 versions, featuring admin dashboard, customer portal, social media gallery, and product management with variants. Currently has a known issue where authenticated admin users cannot add products due to backend permission validation failure."
}