{
  "backend/main.mo": "Main backend actor defining data types (Product, Order, Customer, DiscussionPost, etc.) and implementing CRUD operations for products, orders, messages, user profiles, shopping carts, and discussion board with role-based access control using mixins for storage and authorization.",
  "feature_evidence.json": "Feature evidence report documenting implementation of discussion board features including public forum page, post list component, question submission form, thread detail view, admin reply form, and React Query hooks with associated files and test IDs.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing components, pages, hooks, and utilities for the Mosslight Studios e-commerce application with discussion board, product catalog, shopping cart, checkout, admin dashboard, and authentication features.",
  "frontend/index.css": "Global CSS with Tailwind directives defining OKLCH color system variables for light and dark themes, including custom brand colors, borders, shadows, and sidebar styling.",
  "frontend/index.html": "HTML entry point with root div and module script reference to main.tsx for the Mosslight Studios React application.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with all application routes (home, products, cart, checkout, forum, admin pages), ThemeProvider, and Toaster for notifications.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Full-page component displaying access denied message with shield icon and return-to-home button for unauthorized users.",
  "frontend/src/components/AddToCartButton.tsx": "Component with quantity input and add-to-cart button that validates inventory, calls useAddItemToCart mutation, and displays loading/success states.",
  "frontend/src/components/AdminReplyForm.tsx": "Admin-only form component for posting replies to discussion board questions with textarea input, role validation, and mutation handling using useReplyToPost hook.",
  "frontend/src/components/AskQuestionForm.tsx": "Form component for authenticated users to post questions to the discussion board with validation, loading states, and toast notifications.",
  "frontend/src/components/CustomerMessagesPanel.tsx": "Displays a list of messages sent to customers, showing broadcast announcements and message content with timestamps.",
  "frontend/src/components/DiscussionPostList.tsx": "Renders a sortable list of discussion posts with status badges, reply counts, and timestamps, linking to individual post detail pages.",
  "frontend/src/components/Footer.tsx": "Site footer displaying copyright information and a branded link to caffeine.ai with UTM tracking parameters.",
  "frontend/src/components/GalleryItem.tsx": "Card component displaying a single social media content item with optional media preview, badges, and text content.",
  "frontend/src/components/GalleryUploadForm.tsx": "Admin form for uploading gallery content with text and media files, featuring upload progress tracking and ExternalBlob handling.",
  "frontend/src/components/Header.tsx": "Main navigation header with logo, menu links, shopping cart with item count badge, login button, and responsive mobile menu.",
  "frontend/src/components/Layout.tsx": "Root layout component wrapping pages with Header, main content area via Outlet, and Footer in a flex column structure.",
  "frontend/src/components/LoginButton.tsx": "Authentication button managing Internet Identity login/logout with loading states, error handling, and query cache clearing.",
  "frontend/src/components/MessageComposer.tsx": "Admin form for composing and sending broadcast messages to all customers with validation and success/error notifications.",
  "frontend/src/components/MessageHistory.tsx": "Displays a chronological list of sent messages with broadcast/direct badges, timestamps, and recipient information for admins.",
  "frontend/src/components/MyOrderCard.tsx": "Displays a single order card for customers showing order ID, date, status badge, line items with product details, and total price calculated from product prices and quantities.",
  "frontend/src/components/OrderList.tsx": "Admin component that displays all orders with search functionality, shows order details with product information, and allows updating order status via dropdown (pending/shipped/delivered).",
  "frontend/src/components/OrderStatusBadge.tsx": "Renders a badge component displaying order status (pending, shipped, delivered) with appropriate visual variants.",
  "frontend/src/components/PostStatusBadge.tsx": "Renders a badge component displaying post status (open or answered) with color-coded styling for light and dark modes.",
  "frontend/src/components/ProductCard.tsx": "Displays a product card with image, name, description, price, and out-of-stock badge; links to product detail page.",
  "frontend/src/components/ProductForm.tsx": "Form component for adding or editing products with fields for name, description, price, inventory, and image uploads with progress tracking.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that requires users to complete their profile (name, email, shipping address) before continuing; cannot be dismissed.",
  "frontend/src/components/ReplyList.tsx": "Displays a sorted list of replies with timestamps and admin badges, highlighting admin responses with special styling.",
  "frontend/src/hooks/useActor.ts": "Manages actor creation with Internet Identity authentication, initializes access control with admin token from URL params, and invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useCart.ts": "Provides React Query hooks for cart operations: viewing cart, adding items, clearing cart, and checkout with automatic query invalidation.",
  "frontend/src/hooks/useCustomerMessages.ts": "Provides a React Query hook to fetch messages for the authenticated customer.",
  "frontend/src/hooks/useCustomerOrders.ts": "Provides React Query hooks to fetch all orders for the authenticated customer or a specific order by ID.",
  "frontend/src/hooks/useDiscussionBoard.ts": "Provides React Query hooks for fetching discussion posts, fetching individual threads, creating new discussion posts, and replying to posts using the actor from useActor.",
  "frontend/src/hooks/useGallery.ts": "Provides React Query hooks for fetching social media content and adding new content (though the add mutation throws an error indicating backend method is not yet implemented).",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication with React context, providing login/logout functionality, identity management, and authentication status tracking using @dfinity/auth-client.",
  "frontend/src/hooks/useMessages.ts": "Provides React Query hooks for fetching messages and sending messages to customers using the actor from useActor.",
  "frontend/src/hooks/useOrders.ts": "Provides React Query hooks for fetching orders and updating order status using the actor from useActor.",
  "frontend/src/hooks/useProducts.ts": "Provides React Query hooks for CRUD operations on products including fetching all products, fetching individual products, adding, updating, and deleting products with image support.",
  "frontend/src/hooks/useUserProfile.ts": "Provides React Query hooks for fetching and saving the current user's profile and fetching their role using the actor from useActor.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom CSS variables for Mosslight Studios brand colors in light and dark modes, and imports Google Fonts (Playfair Display and Inter).",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component into the root DOM element.",
  "frontend/src/pages/AdminGalleryPage.tsx": "Admin page for managing social media gallery content with role-based access control, displaying a GalleryUploadForm for admins or AccessDeniedScreen for non-admins.",
  "frontend/src/pages/AdminMessagesPage.tsx": "Admin page with tabbed interface for composing messages to customers and viewing message history, protected by role-based access control.",
  "frontend/src/pages/AdminOrdersPage.tsx": "Admin page for viewing and managing customer orders with role-based access control, displaying an OrderList component.",
  "frontend/src/pages/AdminProductsPage.tsx": "Admin page for managing products with CRUD operations, displaying a grid of product cards with edit/delete actions or a ProductForm for adding/editing products.",
  "frontend/src/pages/CartPage.tsx": "Displays shopping cart with product details, quantities, and total price; allows users to clear cart and proceed to checkout.",
  "frontend/src/pages/CheckoutPage.tsx": "Handles checkout flow with shipping information from user profile and payment input; requires authentication and profile setup before proceeding.",
  "frontend/src/pages/ForumPage.tsx": "Displays discussion board with list of customer questions and a form to ask new questions.",
  "frontend/src/pages/ForumThreadPage.tsx": "Shows individual discussion thread with question details, replies, and admin reply form.",
  "frontend/src/pages/GalleryPage.tsx": "Displays grid of social media content items (photos, videos, stories) from the gallery.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section, feature highlights, and call-to-action buttons for products and gallery.",
  "frontend/src/pages/MyOrdersPage.tsx": "Authenticated user account page with tabs for viewing order history and customer messages; requires profile setup.",
  "frontend/src/pages/OrderSuccessPage.tsx": "Order confirmation page displaying success message with order ID and navigation to orders or products.",
  "frontend/src/pages/ProductDetailPage.tsx": "Product detail page component that displays a single product with image, name, price, inventory status, description, and an add-to-cart button. Includes loading states, error handling for missing products, and navigation back to the products list.",
  "frontend/src/pages/ProductsPage.tsx": "Products listing page component that displays all available products in a responsive grid layout using ProductCard components. Shows loading state and empty state when no products are available.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support. Includes functions to get, store, clear, and persist URL parameters across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining the design system with custom colors (emerald green primary, nude secondary), typography (Playfair Display serif, Inter sans), shadows, animations, and theme extensions for the Mosslight Studios brand.",
  "project_state.json": "Project state file documenting the ecommerce platform architecture with 10 implemented features including product management, order tracking, customer authentication, admin messaging, social media gallery, and shopping cart functionality."
}