{
  "backend/main.mo": "Main backend actor implementing e-commerce functionality including products, orders, shopping carts, user profiles, notifications, reviews, analytics, discussion forum, and access control with role-based permissions.",
  "feature_evidence.json": "Feature evidence report documenting implemented features for notifications, reviews, analytics, and forum functionality with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including pages, components, hooks, and utilities for the Mosslight Studios e-commerce application.",
  "frontend/index.css": "Global CSS with Tailwind directives and OKLCH color system defining light and dark theme variables for the Mosslight Studios brand.",
  "frontend/index.html": "HTML entry point with root div and module script reference for the React application.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with all routes (home, products, cart, gallery, forum, admin pages) and wrapping with ThemeProvider, AdminAuthProvider, and Toaster.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Full-page component displaying access denied message with shield icon and return-to-home button for unauthorized access attempts.",
  "frontend/src/components/AddToCartButton.tsx": "Component with quantity input and add-to-cart button that validates inventory and handles cart mutations with loading states and toast notifications.",
  "frontend/src/components/AdminGuard.tsx": "Guard component that checks admin authentication via passcode and renders AccessDeniedScreen if unauthorized, otherwise renders children.",
  "frontend/src/components/AdminLoginModal.tsx": "Modal dialog for admin authentication requiring an 8-digit passcode, redirects to admin dashboard on successful login.",
  "frontend/src/components/AdminNotificationsPanel.tsx": "Displays unread admin alerts and low inventory notifications with ability to mark as read.",
  "frontend/src/components/AdminReplyForm.tsx": "Form component allowing admin users to post replies to discussion board posts.",
  "frontend/src/components/AskQuestionForm.tsx": "Form for authenticated users to submit questions to the discussion board.",
  "frontend/src/components/CustomerMessagesPanel.tsx": "Displays a list of messages sent to customers, distinguishing between direct messages and broadcast announcements.",
  "frontend/src/components/DiscussionPostList.tsx": "Renders a sorted list of discussion posts with status badges, timestamps, and reply counts as clickable cards.",
  "frontend/src/components/Footer.tsx": "Site footer displaying copyright, social media links, and attribution to caffeine.ai.",
  "frontend/src/components/GalleryItem.tsx": "Card component displaying social media content with optional media, recording analytics view events on mount.",
  "frontend/src/components/GalleryUploadForm.tsx": "Form for uploading gallery content with text and media files, showing upload progress for file uploads.",
  "frontend/src/components/Header.tsx": "Main navigation header component with responsive menu, authentication controls, cart icon with item count, notification bell, and conditional admin dashboard link based on user role.",
  "frontend/src/components/Layout.tsx": "Root layout component that wraps pages with Header, main content area using Outlet, and Footer in a flex column structure.",
  "frontend/src/components/LoginButton.tsx": "Authentication button component that handles Internet Identity login/logout and provides an admin login modal trigger for unauthenticated users.",
  "frontend/src/components/MessageComposer.tsx": "Admin form component for composing and sending broadcast messages to all customers with textarea input and recipient type selection.",
  "frontend/src/components/MessageHistory.tsx": "Displays a list of previously sent messages with timestamps, content, and broadcast/direct badges in card format.",
  "frontend/src/components/MyOrderCard.tsx": "Card component displaying individual order details including order ID, date, status badge, line items with quantities, and calculated total price.",
  "frontend/src/components/NotificationBell.tsx": "Dropdown notification bell component showing unread notifications with icons, timestamps, and mark-as-read functionality on click.",
  "frontend/src/components/OrderList.tsx": "Admin component displaying filterable list of orders with search functionality and inline status update dropdowns for each order.",
  "frontend/src/components/OrderStatusBadge.tsx": "Simple badge component that displays order status (pending, shipped, delivered) with appropriate styling variants.",
  "frontend/src/components/PostStatusBadge.tsx": "Badge component for forum post status (open, answered) with custom color styling for each state.",
  "frontend/src/components/ProductCard.tsx": "Displays a product card with image, name, price, description, rating stars, review count, and out-of-stock badge. Records analytics events on click and links to product detail page.",
  "frontend/src/components/ProductForm.tsx": "Form component for adding or editing products with fields for name, description, price, inventory, and image uploads. Handles image upload progress and submits data via mutation hooks.",
  "frontend/src/components/ProductReviews.tsx": "Displays a list of product reviews with star ratings, verified purchase badges, timestamps, and average rating summary. Shows loading state and empty state when no reviews exist.",
  "frontend/src/components/ProductSearch.tsx": "Provides search input and price range filter dropdown for products. Filters products in real-time based on search term and selected price range, with a clear filters button.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for first-time user profile setup requiring name, email, and shipping address. Cannot be dismissed until profile is completed.",
  "frontend/src/components/ReplyList.tsx": "Displays a sorted list of admin replies with timestamps and admin badges in styled cards. Replies are sorted chronologically by timestamp.",
  "frontend/src/components/ReviewForm.tsx": "Form for authenticated users to submit product reviews with star rating selection and text input. Validates authentication, rating, and review text before submission.",
  "frontend/src/components/SocialMediaLinks.tsx": "Renders social media icon links for Instagram, Facebook, and TikTok with hover effects and accessibility labels.",
  "frontend/src/hooks/useActor.ts": "Manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity login state and initializing access control with an admin token from URL parameters.",
  "frontend/src/hooks/useAdminAuth.tsx": "Provides admin authentication context with a hardcoded passcode ('09131991'), storing session state in localStorage and exposing login/logout functions.",
  "frontend/src/hooks/useAnalytics.ts": "Exposes hooks to fetch analytics data (clicks, views, revenue, orders, low inventory) and record analytics events (product clicks, content views, order completions).",
  "frontend/src/hooks/useCart.ts": "Provides React Query hooks for cart operations: viewing cart items, adding items, clearing cart, and checking out with automatic query invalidation.",
  "frontend/src/hooks/useCustomerMessages.ts": "Fetches messages for the current customer using React Query.",
  "frontend/src/hooks/useCustomerOrders.ts": "Provides hooks to fetch all orders for the current customer or a specific order by ID.",
  "frontend/src/hooks/useDiscussionBoard.ts": "Manages discussion board operations including fetching all posts, fetching individual threads, creating new posts, and adding replies with query invalidation.",
  "frontend/src/hooks/useGallery.ts": "Fetches social media content and provides a placeholder mutation for adding content (not yet implemented in backend).",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context with login/logout functionality, identity management, and status tracking using @dfinity/auth-client.",
  "frontend/src/hooks/useMessages.ts": "Provides hooks to fetch all messages and send messages to specific recipients with automatic query invalidation.",
  "frontend/src/hooks/useNotifications.ts": "Manages user notifications with hooks to fetch unread notifications and mark them as read.",
  "frontend/src/hooks/useOrders.ts": "Provides admin-level hooks to fetch all orders and update order status with query invalidation.",
  "frontend/src/hooks/useProducts.ts": "Manages product CRUD operations including fetching all products, individual products, and mutations for adding, updating, and deleting products with image support.",
  "frontend/src/hooks/useReviews.ts": "Handles product reviews with hooks to fetch reviews and average ratings for a product, and submit new reviews.",
  "frontend/src/hooks/useUserProfile.ts": "Manages user profile operations including fetching and saving the caller's profile and retrieving their role with React Query.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for Mosslight Studios brand colors in light and dark modes, plus font imports for Playfair Display and Inter.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/AboutPage.tsx": "Static about page displaying Mosslight Studios' story, mission, and contact information with social media links.",
  "frontend/src/pages/AdminAnalyticsPage.tsx": "Admin-only analytics dashboard showing revenue, order count, product clicks, content views, and low inventory alerts using data from useGetAnalyticsData hook.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Main admin dashboard with navigation cards to product management, orders, messaging, gallery, forum, and analytics sections, plus an admin notifications panel.",
  "frontend/src/pages/AdminGalleryPage.tsx": "Admin page for uploading and managing gallery/social media content using the GalleryUploadForm component.",
  "frontend/src/pages/AdminMessagesPage.tsx": "Admin messaging page with tabs for composing new messages to customers and viewing message history.",
  "frontend/src/pages/AdminOrdersPage.tsx": "Admin page displaying all customer orders using the OrderList component with data from useGetOrders hook.",
  "frontend/src/pages/AdminProductsPage.tsx": "Admin product management page with grid view of products and functionality to add, edit, and delete products using ProductForm component.",
  "frontend/src/pages/CartPage.tsx": "Displays shopping cart with product details, quantities, and total price; allows users to clear cart and proceed to checkout.",
  "frontend/src/pages/CheckoutPage.tsx": "Handles checkout flow with authentication check, profile validation, shipping info display, and payment form submission to complete orders.",
  "frontend/src/pages/FAQPage.tsx": "Displays frequently asked questions organized by categories (Shipping, Returns, Product Care, Ordering) using an accordion component.",
  "frontend/src/pages/ForumPage.tsx": "Shows discussion board with question submission form and list of recent customer questions with loading states.",
  "frontend/src/pages/ForumThreadPage.tsx": "Displays individual forum post thread with question details, status badge, replies list, and admin reply form.",
  "frontend/src/pages/GalleryPage.tsx": "Renders gallery of social media content in a grid layout with social media links and loading state.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section, feature highlights (curated collection, handmade, unique designs), and call-to-action buttons for products and gallery.",
  "frontend/src/pages/MyOrdersPage.tsx": "Customer account page with tabs for viewing order history and messages, includes authentication check, profile setup modal, and displays user's orders and messages with loading states.",
  "frontend/src/pages/OrderSuccessPage.tsx": "Order confirmation page displaying success message with order ID, provides navigation buttons to view orders or continue shopping.",
  "frontend/src/pages/ProductDetailPage.tsx": "Product detail page showing product image, name, price, inventory status, description, add-to-cart button, review form, and customer reviews section.",
  "frontend/src/pages/ProductsPage.tsx": "Product catalog page displaying all products in a grid with search/filter functionality and product count display.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining Mosslight Studios brand colors (emerald green, nude), custom shadows, typography, animations, and component styling tokens using OKLCH color space.",
  "project_state.json": "Project metadata documenting the ecommerce platform architecture, features including admin dashboard, customer portal, social media gallery, authentication systems, and known implementation details."
}