{
  "backend/main.mo": "Main backend actor defining all data types (Product, Order, Customer, Review, Notification, etc.) and state maps, with mixins for blob storage and authorization/access control.",
  "feature_evidence.json": "Feature evidence report documenting three high-confidence features related to admin authentication, authorization context accessibility, and error logging in product operations.",
  "frontend-file-summaries.txt": "Pre-existing summaries of frontend files covering components, pages, hooks, and utilities for the Mosslight Studios e-commerce application with admin authentication via passcode.",
  "frontend/index.css": "Global CSS with Tailwind directives and OKLCH color system variables for light and dark themes, defining design tokens for the application.",
  "frontend/index.html": "HTML entry point with root div and module script reference to main.tsx for the Mosslight Studios application.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with all routes (home, products, cart, gallery, forum, admin pages) and wrapping with ThemeProvider, AdminAuthProvider, and Toaster.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Full-page component displaying an access denied message with shield icon and return-to-home button for unauthorized access attempts.",
  "frontend/src/components/AddToCartButton.tsx": "Component with quantity input and add-to-cart button that validates variant selection, inventory availability, and handles cart mutations with toast notifications.",
  "frontend/src/components/AdminGuard.tsx": "Guard component that checks admin authentication status and renders AccessDeniedScreen if not authenticated, otherwise renders children.",
  "frontend/src/components/AdminLoginModal.tsx": "Modal dialog component for admin authentication using an 8-digit passcode, with form validation and navigation to admin dashboard on success.",
  "frontend/src/components/AdminNotificationsPanel.tsx": "Displays unread admin alerts and low inventory notifications in a card with icons, timestamps, and mark-as-read functionality.",
  "frontend/src/components/AdminReplyForm.tsx": "Form component allowing admin users to post replies to discussion board posts, with role-based visibility and submission handling.",
  "frontend/src/components/AskQuestionForm.tsx": "Form for authenticated users to submit questions to the discussion board with validation and authentication checks.",
  "frontend/src/components/CustomerMessagesPanel.tsx": "Displays a list of messages sent to customers, showing timestamps and distinguishing broadcast announcements from direct messages.",
  "frontend/src/components/DiscussionPostList.tsx": "Renders a sorted list of discussion posts as clickable cards showing question text, status badge, timestamp, and reply count.",
  "frontend/src/components/Footer.tsx": "Application footer displaying copyright, social media links, and attribution to caffeine.ai with dynamic year and hostname.",
  "frontend/src/components/GalleryItem.tsx": "Card component displaying social media content with optional media image, timestamp, and analytics tracking on mount.",
  "frontend/src/components/GalleryUploadForm.tsx": "Form for uploading gallery content with text and multiple media files, featuring upload progress tracking and file preview.",
  "frontend/src/components/Header.tsx": "Main navigation header component with logo, navigation links (Shop, Gallery, About, FAQ, Forum, My Orders), shopping cart with item count badge, notification bell, and login/admin authentication controls. Includes mobile menu toggle and conditional rendering based on authentication state.",
  "frontend/src/components/Layout.tsx": "Root layout component that wraps all pages with Header, main content area (using Outlet for nested routes), and Footer in a flex column structure.",
  "frontend/src/components/LoginButton.tsx": "Authentication button component that handles Internet Identity login/logout with query cache clearing, includes an admin login modal trigger, and displays appropriate icons and loading states.",
  "frontend/src/components/MessageComposer.tsx": "Admin message composition form with radio group for recipient selection (currently only supports broadcast to all customers), textarea for message content, and send functionality with loading states.",
  "frontend/src/components/MessageHistory.tsx": "Displays a list of sent messages in card format showing message ID, timestamp, content, recipient type (broadcast/direct), and recipient principal if applicable.",
  "frontend/src/components/MyOrderCard.tsx": "Customer-facing order card displaying order ID, date, status badge, line items with product names/quantities/variants, and calculated total price from product data.",
  "frontend/src/components/NotificationBell.tsx": "Dropdown notification bell icon with unread count badge, displays scrollable list of notifications with icons (order updates, low inventory, general), timestamps, and mark-as-read functionality.",
  "frontend/src/components/OrderList.tsx": "Admin order management component with search filtering by order ID or customer, displays orders in cards with status badges, inline status update dropdown, and calculated totals from product data.",
  "frontend/src/components/OrderStatusBadge.tsx": "Reusable badge component that displays order status (pending, shipped, delivered) with appropriate styling variants.",
  "frontend/src/components/PostStatusBadge.tsx": "Reusable badge component that displays forum post status (open, answered) with color-coded styling for light and dark modes.",
  "frontend/src/components/ProductCard.tsx": "Displays a product card with image, name, price, description, rating stars, review count, and out-of-stock badge. Records analytics events on click and links to product detail page.",
  "frontend/src/components/ProductForm.tsx": "Form component for creating or editing products with fields for name, description, price, inventory, images, and optional variants. Includes validation, image upload with progress tracking, and admin authentication checks.",
  "frontend/src/components/ProductReviews.tsx": "Displays product reviews with star ratings, verified purchase badges, and timestamps. Shows average rating summary and handles empty state when no reviews exist.",
  "frontend/src/components/ProductSearch.tsx": "Provides search and filter UI for products with text search and price range dropdown. Filters products in real-time and includes a clear filters button.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for first-time user profile setup requiring name, email, and shipping address. Cannot be dismissed until profile is completed.",
  "frontend/src/components/ReplyList.tsx": "Displays a sorted list of admin replies with timestamps and admin badges in styled cards.",
  "frontend/src/components/ReviewForm.tsx": "Form for authenticated users to submit product reviews with star rating selection and text input. Validates authentication and purchase status before submission.",
  "frontend/src/components/SocialMediaLinks.tsx": "Renders social media icon links for Instagram, Facebook, and TikTok with hover effects.",
  "frontend/src/components/VariantManager.tsx": "React component for managing product variants (size, color, price, inventory) with add, edit, and delete functionality, including form validation and toast notifications.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance with Internet Identity authentication, initializing access control and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useAdminAuth.tsx": "Context provider and hook for admin authentication using a hardcoded passcode (09131991), persisting session state in localStorage.",
  "frontend/src/hooks/useAnalytics.ts": "React Query hooks for fetching analytics data (product clicks, content views, revenue, orders, low inventory) and recording analytics events.",
  "frontend/src/hooks/useCart.ts": "React Query hooks for cart operations including viewing cart, adding items, clearing cart, and checkout with automatic query invalidation.",
  "frontend/src/hooks/useCustomerMessages.ts": "React Query hook for fetching customer messages using the backend actor.",
  "frontend/src/hooks/useCustomerOrders.ts": "React Query hooks for fetching customer orders, both all orders and individual order by ID.",
  "frontend/src/hooks/useDiscussionBoard.ts": "React Query hooks for discussion board operations including fetching posts/threads, creating posts, and adding replies with query invalidation.",
  "frontend/src/hooks/useGallery.ts": "React Query hooks for fetching social media content and a placeholder mutation for adding content (not yet implemented in backend).",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login/logout state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useMessages.ts": "React Query hooks for fetching all messages and sending messages to customers with query invalidation.",
  "frontend/src/hooks/useNotifications.ts": "React Query hooks for fetching unread notifications and marking notifications as read with query invalidation.",
  "frontend/src/hooks/useOrders.ts": "React Query hooks for fetching all orders and updating order status with query invalidation.",
  "frontend/src/hooks/useProducts.ts": "Provides React Query hooks for product CRUD operations (get all products, get single product, add product, update product, delete product) with extensive logging for debugging admin authentication and product data flow.",
  "frontend/src/hooks/useProductVariants.ts": "React Query hook for fetching product variants by product ID with 30-second stale time.",
  "frontend/src/hooks/useReviews.ts": "Exports React Query hooks for fetching product reviews with average ratings and submitting new reviews, with automatic cache invalidation on submission.",
  "frontend/src/hooks/useUserProfile.ts": "Provides hooks to fetch and save the current user's profile and role using React Query, with proper loading states and cache management.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom Mosslight Studios brand colors in OKLCH format for both light and dark modes, plus typography settings using Playfair Display and Inter fonts.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/AboutPage.tsx": "Displays the About page with Mosslight Studios' story, mission, and contact information including email and social media links.",
  "frontend/src/pages/AdminAnalyticsPage.tsx": "Admin-only analytics dashboard showing revenue, order count, product clicks, content views, low inventory alerts, and top-performing products/content.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Main admin dashboard with navigation cards to product management, orders, messaging, gallery, forum, and analytics sections, plus an admin notifications panel.",
  "frontend/src/pages/AdminGalleryPage.tsx": "Admin page for uploading and managing gallery/social media content using the GalleryUploadForm component.",
  "frontend/src/pages/AdminMessagesPage.tsx": "Admin messaging interface with tabs for composing new messages to customers and viewing message history.",
  "frontend/src/pages/AdminOrdersPage.tsx": "Admin page that displays and manages customer orders using the OrderList component, protected by AdminGuard with loading state.",
  "frontend/src/pages/AdminProductsPage.tsx": "Admin page for managing products with CRUD operations (create, read, update, delete), displaying products in a grid with edit/delete actions and a ProductForm modal.",
  "frontend/src/pages/CartPage.tsx": "Shopping cart page that displays cart items with product details and variants, calculates totals, and provides clear cart and checkout navigation.",
  "frontend/src/pages/CheckoutPage.tsx": "Checkout page requiring authentication that displays user profile shipping info and a payment form, with ProfileSetupModal for users without profiles.",
  "frontend/src/pages/FAQPage.tsx": "Static FAQ page displaying categorized questions and answers about shipping, returns, product care, and ordering using an accordion component.",
  "frontend/src/pages/ForumPage.tsx": "Discussion board page showing a list of posts with an AskQuestionForm for users to submit new questions.",
  "frontend/src/pages/ForumThreadPage.tsx": "Individual forum thread page displaying a question post with its replies and an AdminReplyForm for responding to questions.",
  "frontend/src/pages/GalleryPage.tsx": "Gallery page displaying social media content items in a grid with social media links and loading/empty states.",
  "frontend/src/pages/HomePage.tsx": "Landing page component with hero section, features grid (curated collection, made with love, unique designs), and call-to-action section linking to products and gallery.",
  "frontend/src/pages/MyOrdersPage.tsx": "Authenticated user account page displaying orders and messages in tabs, with profile setup modal for new users and access denied screen for unauthenticated visitors.",
  "frontend/src/pages/OrderSuccessPage.tsx": "Order confirmation page showing success message with order ID and navigation buttons to view orders or continue shopping.",
  "frontend/src/pages/ProductDetailPage.tsx": "Product detail page with image display, variant selection (size/color), pricing, inventory status, add-to-cart functionality, and product reviews section.",
  "frontend/src/pages/ProductsPage.tsx": "Product listing page with search/filter functionality, displaying all products in a responsive grid with loading states and empty state messages.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and persisting URL parameters from both regular query strings and hash-based routing, with sessionStorage integration for parameter persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme (emerald/nude palette using OKLCH), typography, container queries, animations, and shadcn/ui component styling setup.",
  "project_state.json": "Project state file tracking an ecommerce platform for Mosslight Studios with 19 versions, featuring admin dashboard, customer portal, social media gallery, and product management with variants. Currently has a known issue where authenticated admin users cannot add products due to backend permission validation failure."
}