{
  "backend/main.mo": "Main actor defining all data types (Product, ProductVariant with price field, Order, Customer, etc.) and backend logic including product management, orders, shopping carts, discussions, notifications, reviews, and analytics with access control and blob storage mixins.",
  "backend/migration.mo": "Migration module that transforms old ProductVariant records (without price field) to new ProductVariant records (with price field defaulted to 0) during actor upgrades.",
  "feature_evidence.json": "Feature evidence report documenting four high-confidence features for variant-specific pricing across VariantManager, ProductDetailPage, CartPage, and MyOrderCard components with associated test IDs.",
  "frontend-file-summaries.txt": "Pre-existing summaries of frontend files describing ProductDetailPage with dynamic variant pricing, CartPage with variant-specific pricing display, and other UI components for the Mosslight Studios e-commerce application.",
  "frontend/index.css": "Global CSS with Tailwind directives and OKLCH color system defining light and dark theme variables for the Mosslight Studios brand palette.",
  "frontend/index.html": "HTML entry point with root div and module script reference to main.tsx for the Mosslight Studios application.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with all routes (home, products, cart, checkout, admin pages, forum, etc.) wrapped in ThemeProvider, AdminAuthProvider, and Toaster.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Full-page access denied component with shield icon, error message, and button to return home for unauthorized users.",
  "frontend/src/components/AddToCartButton.tsx": "A component that handles adding products to cart with quantity selection, variant support (size/color), inventory validation, and loading states. Displays appropriate error messages and success toasts for various cart operations.",
  "frontend/src/components/AdminGuard.tsx": "A route guard component that checks admin authentication status and either renders children for authenticated admins or displays an access denied screen.",
  "frontend/src/components/AdminLoginModal.tsx": "A modal dialog for admin authentication that accepts an 8-digit passcode, validates it, and navigates to the admin dashboard on successful login.",
  "frontend/src/components/AdminNotificationsPanel.tsx": "Displays unread admin alerts and low inventory notifications in a card with icons, timestamps, and mark-as-read functionality. Returns null if no notifications exist.",
  "frontend/src/components/AdminReplyForm.tsx": "A form component that allows admin users to post replies to discussion board posts, with role-based visibility and loading states.",
  "frontend/src/components/AskQuestionForm.tsx": "A form for authenticated users to post questions to the discussion board, with validation and loading states.",
  "frontend/src/components/CustomerMessagesPanel.tsx": "Displays a list of messages sent to customers, showing broadcast announcements and direct messages with timestamps in card format.",
  "frontend/src/components/DiscussionPostList.tsx": "Renders a sorted list of discussion posts with question preview, status badge, timestamp, and reply count, linking to individual post detail pages.",
  "frontend/src/components/Footer.tsx": "A footer component displaying copyright information, social media links, and a powered-by attribution to caffeine.ai with UTM tracking.",
  "frontend/src/components/GalleryItem.tsx": "Displays a social media content item with optional media image, timestamp, content type badge, and records analytics view events on mount.",
  "frontend/src/components/GalleryUploadForm.tsx": "Form component for uploading social media content with text and media files (images/videos), including upload progress tracking and toast notifications.",
  "frontend/src/components/Header.tsx": "Main navigation header with logo, menu links (Shop, Gallery, About, FAQ, Forum, My Orders), cart icon with item count, login/logout buttons, admin dashboard access, and mobile menu support.",
  "frontend/src/components/Layout.tsx": "Root layout component that wraps pages with Header, main content area (Outlet), and Footer in a flex column structure.",
  "frontend/src/components/LoginButton.tsx": "Authentication button component that handles Internet Identity login/logout and provides an admin login modal option for non-authenticated users.",
  "frontend/src/components/MessageComposer.tsx": "Form component for composing and sending broadcast messages to all customers with textarea input and recipient type selection.",
  "frontend/src/components/MessageHistory.tsx": "Displays a list of sent messages with timestamps, content, recipient info, and broadcast/direct badges in card format.",
  "frontend/src/components/MyOrderCard.tsx": "Card component displaying order details including order ID, date, status badge, line items with variants, and calculated total price.",
  "frontend/src/components/NotificationBell.tsx": "Dropdown notification bell icon with badge count showing unread notifications, categorized by type (order updates, low inventory, etc.) with relative timestamps and mark-as-read functionality.",
  "frontend/src/components/OrderList.tsx": "Displays a searchable list of orders with status badges and dropdowns to update order status, showing order details, customer info, items, and totals.",
  "frontend/src/components/OrderStatusBadge.tsx": "Renders a badge component displaying order status (pending, shipped, delivered) with appropriate styling variants.",
  "frontend/src/components/PostStatusBadge.tsx": "Renders a badge component displaying post status (open, answered) with custom color styling for each state.",
  "frontend/src/components/ProductCard.tsx": "Displays a product card with image, name, description, price, stock status, star ratings, and review count, recording analytics on click.",
  "frontend/src/components/ProductForm.tsx": "Form component for adding or editing products with fields for name, description, price, inventory, variants, and image uploads with progress tracking.",
  "frontend/src/components/ProductReviews.tsx": "Displays product reviews with star ratings, average rating summary, verified purchase badges, and timestamps sorted by date.",
  "frontend/src/components/ProductSearch.tsx": "Provides search input and price range filter dropdown for products, with clear filters button and real-time filtering.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for first-time users to set up their profile with name, email, and shipping address fields, preventing dismissal until completed.",
  "frontend/src/components/ReplyList.tsx": "Displays a sorted list of admin replies with timestamps, badges, and formatted content in styled cards.",
  "frontend/src/components/ReviewForm.tsx": "Provides a form for authenticated users to submit product reviews with star ratings and text content, including validation and purchase verification.",
  "frontend/src/components/SocialMediaLinks.tsx": "Renders social media icons (Instagram, Facebook, TikTok) with links to Moss Light Studios profiles.",
  "frontend/src/components/VariantManager.tsx": "Manages product variants (size, color, price, inventory) with add, edit, and delete functionality in a table interface.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance with Internet Identity authentication, initializing access control and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useAdminAuth.tsx": "Provides admin authentication context with passcode-based login/logout and localStorage session persistence.",
  "frontend/src/hooks/useAnalytics.ts": "Exposes hooks for fetching analytics data (clicks, views, revenue, inventory) and recording analytics events.",
  "frontend/src/hooks/useCart.ts": "Provides React Query hooks for cart operations: viewing, adding items, clearing, and checkout with automatic cache invalidation.",
  "frontend/src/hooks/useCustomerMessages.ts": "Fetches customer messages for the authenticated user via the backend actor.",
  "frontend/src/hooks/useCustomerOrders.ts": "Provides hooks to fetch all orders or a specific order for the authenticated customer.",
  "frontend/src/hooks/useDiscussionBoard.ts": "Manages discussion board operations including fetching posts/threads, creating posts, and adding replies with cache invalidation.",
  "frontend/src/hooks/useGallery.ts": "Fetches social media content from the backend; includes a placeholder mutation for adding content (not yet implemented in backend).",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity storage, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useMessages.ts": "Exports React Query hooks for fetching messages and sending messages with recipient information, with automatic cache invalidation on mutations.",
  "frontend/src/hooks/useNotifications.ts": "Provides React Query hooks for fetching unread notifications and marking them as read, with automatic query invalidation.",
  "frontend/src/hooks/useOrders.ts": "Exports hooks for fetching orders and updating order status using React Query with cache invalidation.",
  "frontend/src/hooks/useProducts.ts": "Exports React Query hooks for CRUD operations on products including fetching, adding, updating, and deleting with image support.",
  "frontend/src/hooks/useProductVariants.ts": "Provides a React Query hook to fetch product variants by product ID with 30-second stale time.",
  "frontend/src/hooks/useReviews.ts": "Provides hooks for fetching product reviews with average ratings and submitting new reviews with optional variant ID.",
  "frontend/src/hooks/useUserProfile.ts": "Exports hooks for fetching and saving the current user's profile and role using React Query with actor availability checks.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom Mosslight Studios brand colors for light and dark modes, plus typography using Playfair Display and Inter fonts.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the App component.",
  "frontend/src/pages/AboutPage.tsx": "Displays the About page with Mosslight Studios' story, mission, and contact information including email and social media links.",
  "frontend/src/pages/AdminAnalyticsPage.tsx": "Admin-only analytics dashboard showing revenue, orders, product clicks, content views, and low inventory alerts with formatted metrics cards.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard landing page displaying six navigation cards for product management, orders, messaging, gallery, forum, and analytics. Protected by AdminGuard and includes AdminNotificationsPanel.",
  "frontend/src/pages/AdminGalleryPage.tsx": "Admin page for managing gallery content with GalleryUploadForm component. Protected by AdminGuard.",
  "frontend/src/pages/AdminMessagesPage.tsx": "Admin messaging page with tabs for composing new messages and viewing message history. Uses MessageComposer and MessageHistory components, protected by AdminGuard.",
  "frontend/src/pages/AdminOrdersPage.tsx": "Admin page displaying all customer orders using OrderList component. Protected by AdminGuard with loading state.",
  "frontend/src/pages/AdminProductsPage.tsx": "Admin product management page with grid view of products, add/edit/delete functionality via ProductForm, and confirmation dialogs. Protected by AdminGuard.",
  "frontend/src/pages/CartPage.tsx": "Shopping cart page displaying cart items with product details, variants, quantities, and totals. Includes clear cart functionality and checkout navigation.",
  "frontend/src/pages/CheckoutPage.tsx": "Checkout page requiring authentication, displaying shipping info from user profile and payment form. Includes ProfileSetupModal for new users and handles order submission.",
  "frontend/src/pages/FAQPage.tsx": "FAQ page with accordion sections covering shipping, returns, product care, and ordering topics. Static content organized by category.",
  "frontend/src/pages/ForumPage.tsx": "Displays the discussion board with a form to ask questions and a list of recent posts. Shows loading state and handles empty state when no posts exist.",
  "frontend/src/pages/ForumThreadPage.tsx": "Shows a single discussion thread with the original question, status badge, replies list, and admin reply form. Includes navigation back to forum and handles post not found state.",
  "frontend/src/pages/GalleryPage.tsx": "Displays a grid of social media content items with social media links and handles loading/empty states. Shows gallery items in a responsive grid layout.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section, three feature cards (Curated Collection, Made with Love, Unique Designs), and CTA section. Uses background images and links to products and gallery.",
  "frontend/src/pages/MyOrdersPage.tsx": "Authenticated user account page with tabs for orders and messages. Includes profile setup modal, access control, and displays user's order history and customer messages.",
  "frontend/src/pages/OrderSuccessPage.tsx": "Order confirmation page displaying success message with order ID and navigation buttons to view orders or continue shopping.",
  "frontend/src/pages/ProductDetailPage.tsx": "Product detail page with image, pricing, variant selection (size/color), add to cart functionality, and product reviews section. Handles variants and inventory status.",
  "frontend/src/pages/ProductsPage.tsx": "Product listing page with search/filter functionality displaying products in a responsive grid. Shows product count and handles empty/filtered states.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage integration for parameter persistence across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme (emerald/nude brand colors, OKLCH-based design tokens), typography, animations, and plugins for the Mosslight Studios ecommerce site.",
  "project_state.json": "Project metadata documenting the Mosslight Studios ecommerce platform architecture, including admin/customer portals, social media gallery, product variants with individual pricing, and existing features like order management and Internet Identity authentication."
}