{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add size-based pricing to product variant system - Frontend Implementation",
  "requirements": [
    {
      "id": "REQ-77",
      "summary": "Update VariantManager component to include price input field for each variant",
      "acceptanceCriteria": [
        "Each variant row in the table displays a price input field",
        "Price values are validated as positive numbers",
        "New variants include price when added",
        "Edited variants can update price values"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/VariantManager.tsx",
          "operation": "modify",
          "description": "Add price input field to the variant table alongside size, color, and inventory fields. Include validation to ensure price is a positive number. Update the add and edit handlers to include price in the variant data structure. Ensure the table displays price in a currency-formatted column."
        }
      ]
    },
    {
      "id": "REQ-78",
      "summary": "Update ProductDetailPage to display selected variant's price dynamically",
      "acceptanceCriteria": [
        "Price updates immediately when size selector changes",
        "Selected variant price displays in the product price area",
        "Price formatting matches existing currency format",
        "Falls back to base product price if no variant is selected"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ProductDetailPage.tsx",
          "operation": "modify",
          "description": "Modify the price display logic to show the selected variant's price when a size is selected. Update the price rendering to dynamically switch between the base product price (when no variant is selected) and the variant-specific price (when a size is chosen). Ensure the price updates immediately when the size selector changes and maintains consistent currency formatting."
        }
      ]
    },
    {
      "id": "REQ-79",
      "summary": "Update addToCart functionality to use selected variant's price",
      "acceptanceCriteria": [
        "Cart items store the variant price at time of addition",
        "Cart calculations use variant price for line item totals",
        "Checkout uses variant price for order total calculation"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AddToCartButton.tsx",
          "operation": "modify",
          "description": "Modify the add-to-cart logic to pass the selected variant's price when adding items with variants to the cart. Ensure the component retrieves the price from the selected variant object and includes it in the cart item data structure sent to the backend."
        },
        {
          "path": "frontend/src/hooks/useCart.ts",
          "operation": "modify",
          "description": "Update the addToCart hook to handle variant price data. Ensure the hook passes variant price information to the backend capability when items are added to the cart. Verify that cart queries properly reflect variant prices in returned data."
        }
      ]
    },
    {
      "id": "REQ-80",
      "summary": "Update CartPage to display variant-specific price for cart items",
      "acceptanceCriteria": [
        "Cart line items show the price of the selected variant",
        "Line item subtotals calculate correctly with variant price",
        "Cart total reflects all variant prices accurately"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/CartPage.tsx",
          "operation": "modify",
          "description": "Update the cart item rendering to display the variant-specific price for each line item that includes product variants. Modify the line item subtotal calculation to use variant price multiplied by quantity. Ensure the cart total accurately sums all variant prices. Update the price display to show the variant price instead of the base product price when variants are present."
        }
      ]
    },
    {
      "id": "REQ-81",
      "summary": "Update MyOrderCard to display variant-specific price in order history",
      "acceptanceCriteria": [
        "Order history shows the exact variant price paid at purchase time",
        "Order line items display size, color, and price together",
        "Order total calculations match the sum of variant prices"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/MyOrderCard.tsx",
          "operation": "modify",
          "description": "Modify the order line item rendering to display the variant-specific price that was paid at the time of purchase. Update the component to show size, color, and price together for each order item with variants. Ensure the order total calculation correctly sums variant prices for accurate historical records."
        }
      ]
    }
  ]
}